GopalSaraf/Practicals/PSDL/include/proc/pic18lf25k83.inc
// Register: RXF14SIDL
#define RXF14SIDL RXF14SIDL
RXF14SIDL                                equ 03729h
// bitfield definitions
RXF14SIDL_EID16_POSN                     equ 0000h
RXF14SIDL_EID16_POSITION                 equ 0000h
RXF14SIDL_EID16_SIZE                     equ 0001h
RXF14SIDL_EID16_LENGTH                   equ 0001h
RXF14SIDL_EID16_MASK                     equ 0001h
RXF14SIDL_EID17_POSN                     equ 0001h
RXF14SIDL_EID17_POSITION                 equ 0001h
RXF14SIDL_EID17_SIZE                     equ 0001h
RXF14SIDL_EID17_LENGTH                   equ 0001h
RXF14SIDL_EID17_MASK                     equ 0002h
RXF14SIDL_EXIDEN_POSN                    equ 0003h
RXF14SIDL_EXIDEN_POSITION                equ 0003h
RXF14SIDL_EXIDEN_SIZE                    equ 0001h
RXF14SIDL_EXIDEN_LENGTH                  equ 0001h
RXF14SIDL_EXIDEN_MASK                    equ 0008h
RXF14SIDL_SID0_POSN                      equ 0005h
RXF14SIDL_SID0_POSITION                  equ 0005h
RXF14SIDL_SID0_SIZE                      equ 0001h
RXF14SIDL_SID0_LENGTH                    equ 0001h
RXF14SIDL_SID0_MASK                      equ 0020h
RXF14SIDL_SID1_POSN                      equ 0006h
RXF14SIDL_SID1_POSITION                  equ 0006h
RXF14SIDL_SID1_SIZE                      equ 0001h
RXF14SIDL_SID1_LENGTH                    equ 0001h
RXF14SIDL_SID1_MASK                      equ 0040h
RXF14SIDL_SID2_POSN                      equ 0007h
RXF14SIDL_SID2_POSITION                  equ 0007h
RXF14SIDL_SID2_SIZE                      equ 0001h
RXF14SIDL_SID2_LENGTH                    equ 0001h
RXF14SIDL_SID2_MASK                      equ 0080h
RXF14SIDL_EID18_POSN                     equ 0005h
RXF14SIDL_EID18_POSITION                 equ 0005h
RXF14SIDL_EID18_SIZE                     equ 0001h
RXF14SIDL_EID18_LENGTH                   equ 0001h
RXF14SIDL_EID18_MASK                     equ 0020h
RXF14SIDL_EID19_POSN                     equ 0006h
RXF14SIDL_EID19_POSITION                 equ 0006h
RXF14SIDL_EID19_SIZE                     equ 0001h
RXF14SIDL_EID19_LENGTH                   equ 0001h
RXF14SIDL_EID19_MASK                     equ 0040h
RXF14SIDL_EID20_POSN                     equ 0007h
RXF14SIDL_EID20_POSITION                 equ 0007h
RXF14SIDL_EID20_SIZE                     equ 0001h
RXF14SIDL_EID20_LENGTH                   equ 0001h
RXF14SIDL_EID20_MASK                     equ 0080h
RXF14SIDL_EID_POSN                       equ 0000h
RXF14SIDL_EID_POSITION                   equ 0000h
RXF14SIDL_EID_SIZE                       equ 0002h
RXF14SIDL_EID_LENGTH                     equ 0002h
RXF14SIDL_EID_MASK                       equ 0003h
RXF14SIDL_SID_POSN                       equ 0005h
RXF14SIDL_SID_POSITION                   equ 0005h
RXF14SIDL_SID_SIZE                       equ 0003h
RXF14SIDL_SID_LENGTH                     equ 0003h
RXF14SIDL_SID_MASK                       equ 00E0h

// Register: RXF14EIDH
#define RXF14EIDH RXF14EIDH
RXF14EIDH                                equ 0372Ah
// bitfield definitions
RXF14EIDH_EID8_POSN                      equ 0000h
RXF14EIDH_EID8_POSITION                  equ 0000h
RXF14EIDH_EID8_SIZE                      equ 0001h
RXF14EIDH_EID8_LENGTH                    equ 0001h
RXF14EIDH_EID8_MASK                      equ 0001h
RXF14EIDH_EID9_POSN                      equ 0001h
RXF14EIDH_EID9_POSITION                  equ 0001h
RXF14EIDH_EID9_SIZE                      equ 0001h
RXF14EIDH_EID9_LENGTH                    equ 0001h
RXF14EIDH_EID9_MASK                      equ 0002h
RXF14EIDH_EID10_POSN                     equ 0002h
RXF14EIDH_EID10_POSITION                 equ 0002h
RXF14EIDH_EID10_SIZE                     equ 0001h
RXF14EIDH_EID10_LENGTH                   equ 0001h
RXF14EIDH_EID10_MASK                     equ 0004h
RXF14EIDH_EID11_POSN                     equ 0003h
RXF14EIDH_EID11_POSITION                 equ 0003h
RXF14EIDH_EID11_SIZE                     equ 0001h
RXF14EIDH_EID11_LENGTH                   equ 0001h
RXF14EIDH_EID11_MASK                     equ 0008h
RXF14EIDH_EID12_POSN                     equ 0004h
RXF14EIDH_EID12_POSITION                 equ 0004h
RXF14EIDH_EID12_SIZE                     equ 0001h
RXF14EIDH_EID12_LENGTH                   equ 0001h
RXF14EIDH_EID12_MASK                     equ 0010h
RXF14EIDH_EID13_POSN                     equ 0005h
RXF14EIDH_EID13_POSITION                 equ 0005h
RXF14EIDH_EID13_SIZE                     equ 0001h
RXF14EIDH_EID13_LENGTH                   equ 0001h
RXF14EIDH_EID13_MASK                     equ 0020h
RXF14EIDH_EID14_POSN                     equ 0006h
RXF14EIDH_EID14_POSITION                 equ 0006h
RXF14EIDH_EID14_SIZE                     equ 0001h
RXF14EIDH_EID14_LENGTH                   equ 0001h
RXF14EIDH_EID14_MASK                     equ 0040h
RXF14EIDH_EID15_POSN                     equ 0007h
RXF14EIDH_EID15_POSITION                 equ 0007h
RXF14EIDH_EID15_SIZE                     equ 0001h
RXF14EIDH_EID15_LENGTH                   equ 0001h
RXF14EIDH_EID15_MASK                     equ 0080h
RXF14EIDH_EID_POSN                       equ 0000h
RXF14EIDH_EID_POSITION                   equ 0000h
RXF14EIDH_EID_SIZE                       equ 0008h
RXF14EIDH_EID_LENGTH                     equ 0008h
RXF14EIDH_EID_MASK                       equ 00FFh

// Register: RXF14EIDL
#define RXF14EIDL RXF14EIDL
RXF14EIDL                                equ 0372Bh
// bitfield definitions
RXF14EIDL_EID0_POSN                      equ 0000h
RXF14EIDL_EID0_POSITION                  equ 0000h
RXF14EIDL_EID0_SIZE                      equ 0001h
RXF14EIDL_EID0_LENGTH                    equ 0001h
RXF14EIDL_EID0_MASK                      equ 0001h
RXF14EIDL_EID1_POSN                      equ 0001h
RXF14EIDL_EID1_POSITION                  equ 0001h
RXF14EIDL_EID1_SIZE                      equ 0001h
RXF14EIDL_EID1_LENGTH                    equ 0001h
RXF14EIDL_EID1_MASK                      equ 0002h
RXF14EIDL_EID2_POSN                      equ 0002h
RXF14EIDL_EID2_POSITION                  equ 0002h
RXF14EIDL_EID2_SIZE                      equ 0001h
RXF14EIDL_EID2_LENGTH                    equ 0001h
RXF14EIDL_EID2_MASK                      equ 0004h
RXF14EIDL_EID3_POSN                      equ 0003h
RXF14EIDL_EID3_POSITION                  equ 0003h
RXF14EIDL_EID3_SIZE                      equ 0001h
RXF14EIDL_EID3_LENGTH                    equ 0001h
RXF14EIDL_EID3_MASK                      equ 0008h
RXF14EIDL_EID4_POSN                      equ 0004h
RXF14EIDL_EID4_POSITION                  equ 0004h
RXF14EIDL_EID4_SIZE                      equ 0001h
RXF14EIDL_EID4_LENGTH                    equ 0001h
RXF14EIDL_EID4_MASK                      equ 0010h
RXF14EIDL_EID5_POSN                      equ 0005h
RXF14EIDL_EID5_POSITION                  equ 0005h
RXF14EIDL_EID5_SIZE                      equ 0001h
RXF14EIDL_EID5_LENGTH                    equ 0001h
RXF14EIDL_EID5_MASK                      equ 0020h
RXF14EIDL_EID6_POSN                      equ 0006h
RXF14EIDL_EID6_POSITION                  equ 0006h
RXF14EIDL_EID6_SIZE                      equ 0001h
RXF14EIDL_EID6_LENGTH                    equ 0001h
RXF14EIDL_EID6_MASK                      equ 0040h
RXF14EIDL_EID7_POSN                      equ 0007h
RXF14EIDL_EID7_POSITION                  equ 0007h
RXF14EIDL_EID7_SIZE                      equ 0001h
RXF14EIDL_EID7_LENGTH                    equ 0001h
RXF14EIDL_EID7_MASK                      equ 0080h
RXF14EIDL_EID_POSN                       equ 0000h
RXF14EIDL_EID_POSITION                   equ 0000h
RXF14EIDL_EID_SIZE                       equ 0008h
RXF14EIDL_EID_LENGTH                     equ 0008h
RXF14EIDL_EID_MASK                       equ 00FFh

// Register: RXF15SIDH
#define RXF15SIDH RXF15SIDH
RXF15SIDH                                equ 0372Ch
// bitfield definitions
RXF15SIDH_SID3_POSN                      equ 0000h
RXF15SIDH_SID3_POSITION                  equ 0000h
RXF15SIDH_SID3_SIZE                      equ 0001h
RXF15SIDH_SID3_LENGTH                    equ 0001h
RXF15SIDH_SID3_MASK                      equ 0001h
RXF15SIDH_SID4_POSN                      equ 0001h
RXF15SIDH_SID4_POSITION                  equ 0001h
RXF15SIDH_SID4_SIZE                      equ 0001h
RXF15SIDH_SID4_LENGTH                    equ 0001h
RXF15SIDH_SID4_MASK                      equ 0002h
RXF15SIDH_SID5_POSN                      equ 0002h
RXF15SIDH_SID5_POSITION                  equ 0002h
RXF15SIDH_SID5_SIZE                      equ 0001h
RXF15SIDH_SID5_LENGTH                    equ 0001h
RXF15SIDH_SID5_MASK                      equ 0004h
RXF15SIDH_SID6_POSN                      equ 0003h
RXF15SIDH_SID6_POSITION                  equ 0003h
RXF15SIDH_SID6_SIZE                      equ 0001h
RXF15SIDH_SID6_LENGTH                    equ 0001h
RXF15SIDH_SID6_MASK                      equ 0008h
RXF15SIDH_SID7_POSN                      equ 0004h
RXF15SIDH_SID7_POSITION                  equ 0004h
RXF15SIDH_SID7_SIZE                      equ 0001h
RXF15SIDH_SID7_LENGTH                    equ 0001h
RXF15SIDH_SID7_MASK                      equ 0010h
RXF15SIDH_SID8_POSN                      equ 0005h
RXF15SIDH_SID8_POSITION                  equ 0005h
RXF15SIDH_SID8_SIZE                      equ 0001h
RXF15SIDH_SID8_LENGTH                    equ 0001h
RXF15SIDH_SID8_MASK                      equ 0020h
RXF15SIDH_SID9_POSN                      equ 0006h
RXF15SIDH_SID9_POSITION                  equ 0006h
RXF15SIDH_SID9_SIZE                      equ 0001h
RXF15SIDH_SID9_LENGTH                    equ 0001h
RXF15SIDH_SID9_MASK                      equ 0040h
RXF15SIDH_SID10_POSN                     equ 0007h
RXF15SIDH_SID10_POSITION                 equ 0007h
RXF15SIDH_SID10_SIZE                     equ 0001h
RXF15SIDH_SID10_LENGTH                   equ 0001h
RXF15SIDH_SID10_MASK                     equ 0080h
RXF15SIDH_EID21_POSN                     equ 0000h
RXF15SIDH_EID21_POSITION                 equ 0000h
RXF15SIDH_EID21_SIZE                     equ 0001h
RXF15SIDH_EID21_LENGTH                   equ 0001h
RXF15SIDH_EID21_MASK                     equ 0001h
RXF15SIDH_EID22_POSN                     equ 0001h
RXF15SIDH_EID22_POSITION                 equ 0001h
RXF15SIDH_EID22_SIZE                     equ 0001h
RXF15SIDH_EID22_LENGTH                   equ 0001h
RXF15SIDH_EID22_MASK                     equ 0002h
RXF15SIDH_EID23_POSN                     equ 0002h
RXF15SIDH_EID23_POSITION                 equ 0002h
RXF15SIDH_EID23_SIZE                     equ 0001h
RXF15SIDH_EID23_LENGTH                   equ 0001h
RXF15SIDH_EID23_MASK                     equ 0004h
RXF15SIDH_EID24_POSN                     equ 0003h
RXF15SIDH_EID24_POSITION                 equ 0003h
RXF15SIDH_EID24_SIZE                     equ 0001h
RXF15SIDH_EID24_LENGTH                   equ 0001h
RXF15SIDH_EID24_MASK                     equ 0008h
RXF15SIDH_EID25_POSN                     equ 0004h
RXF15SIDH_EID25_POSITION                 equ 0004h
RXF15SIDH_EID25_SIZE                     equ 0001h
RXF15SIDH_EID25_LENGTH                   equ 0001h
RXF15SIDH_EID25_MASK                     equ 0010h
RXF15SIDH_EID26_POSN                     equ 0005h
RXF15SIDH_EID26_POSITION                 equ 0005h
RXF15SIDH_EID26_SIZE                     equ 0001h
RXF15SIDH_EID26_LENGTH                   equ 0001h
RXF15SIDH_EID26_MASK                     equ 0020h
RXF15SIDH_EID27_POSN                     equ 0006h
RXF15SIDH_EID27_POSITION                 equ 0006h
RXF15SIDH_EID27_SIZE                     equ 0001h
RXF15SIDH_EID27_LENGTH                   equ 0001h
RXF15SIDH_EID27_MASK                     equ 0040h
RXF15SIDH_EID28_POSN                     equ 0007h
RXF15SIDH_EID28_POSITION                 equ 0007h
RXF15SIDH_EID28_SIZE                     equ 0001h
RXF15SIDH_EID28_LENGTH                   equ 0001h
RXF15SIDH_EID28_MASK                     equ 0080h
RXF15SIDH_SID_POSN                       equ 0000h
RXF15SIDH_SID_POSITION                   equ 0000h
RXF15SIDH_SID_SIZE                       equ 0008h
RXF15SIDH_SID_LENGTH                     equ 0008h
RXF15SIDH_SID_MASK                       equ 00FFh

