GopalSaraf/Practicals/PSDL/include/proc/pic18lf25k83.inc
// Register: B0SIDL
#define B0SIDL B0SIDL
B0SIDL                                   equ 03742h
// bitfield definitions
B0SIDL_EID16_POSN                        equ 0000h
B0SIDL_EID16_POSITION                    equ 0000h
B0SIDL_EID16_SIZE                        equ 0001h
B0SIDL_EID16_LENGTH                      equ 0001h
B0SIDL_EID16_MASK                        equ 0001h
B0SIDL_EID17_POSN                        equ 0001h
B0SIDL_EID17_POSITION                    equ 0001h
B0SIDL_EID17_SIZE                        equ 0001h
B0SIDL_EID17_LENGTH                      equ 0001h
B0SIDL_EID17_MASK                        equ 0002h
B0SIDL_EXIDE_POSN                        equ 0003h
B0SIDL_EXIDE_POSITION                    equ 0003h
B0SIDL_EXIDE_SIZE                        equ 0001h
B0SIDL_EXIDE_LENGTH                      equ 0001h
B0SIDL_EXIDE_MASK                        equ 0008h
B0SIDL_SRR_POSN                          equ 0004h
B0SIDL_SRR_POSITION                      equ 0004h
B0SIDL_SRR_SIZE                          equ 0001h
B0SIDL_SRR_LENGTH                        equ 0001h
B0SIDL_SRR_MASK                          equ 0010h
B0SIDL_SID0_POSN                         equ 0005h
B0SIDL_SID0_POSITION                     equ 0005h
B0SIDL_SID0_SIZE                         equ 0001h
B0SIDL_SID0_LENGTH                       equ 0001h
B0SIDL_SID0_MASK                         equ 0020h
B0SIDL_SID1_POSN                         equ 0006h
B0SIDL_SID1_POSITION                     equ 0006h
B0SIDL_SID1_SIZE                         equ 0001h
B0SIDL_SID1_LENGTH                       equ 0001h
B0SIDL_SID1_MASK                         equ 0040h
B0SIDL_SID2_POSN                         equ 0007h
B0SIDL_SID2_POSITION                     equ 0007h
B0SIDL_SID2_SIZE                         equ 0001h
B0SIDL_SID2_LENGTH                       equ 0001h
B0SIDL_SID2_MASK                         equ 0080h
B0SIDL_EID18_POSN                        equ 0005h
B0SIDL_EID18_POSITION                    equ 0005h
B0SIDL_EID18_SIZE                        equ 0001h
B0SIDL_EID18_LENGTH                      equ 0001h
B0SIDL_EID18_MASK                        equ 0020h
B0SIDL_EID19_POSN                        equ 0006h
B0SIDL_EID19_POSITION                    equ 0006h
B0SIDL_EID19_SIZE                        equ 0001h
B0SIDL_EID19_LENGTH                      equ 0001h
B0SIDL_EID19_MASK                        equ 0040h
B0SIDL_EID20_POSN                        equ 0007h
B0SIDL_EID20_POSITION                    equ 0007h
B0SIDL_EID20_SIZE                        equ 0001h
B0SIDL_EID20_LENGTH                      equ 0001h
B0SIDL_EID20_MASK                        equ 0080h
B0SIDL_EID_POSN                          equ 0000h
B0SIDL_EID_POSITION                      equ 0000h
B0SIDL_EID_SIZE                          equ 0002h
B0SIDL_EID_LENGTH                        equ 0002h
B0SIDL_EID_MASK                          equ 0003h
B0SIDL_SID_POSN                          equ 0005h
B0SIDL_SID_POSITION                      equ 0005h
B0SIDL_SID_SIZE                          equ 0003h
B0SIDL_SID_LENGTH                        equ 0003h
B0SIDL_SID_MASK                          equ 00E0h

// Register: B0EIDH
#define B0EIDH B0EIDH
B0EIDH                                   equ 03743h
// bitfield definitions
B0EIDH_EID8_POSN                         equ 0000h
B0EIDH_EID8_POSITION                     equ 0000h
B0EIDH_EID8_SIZE                         equ 0001h
B0EIDH_EID8_LENGTH                       equ 0001h
B0EIDH_EID8_MASK                         equ 0001h
B0EIDH_EID9_POSN                         equ 0001h
B0EIDH_EID9_POSITION                     equ 0001h
B0EIDH_EID9_SIZE                         equ 0001h
B0EIDH_EID9_LENGTH                       equ 0001h
B0EIDH_EID9_MASK                         equ 0002h
B0EIDH_EID10_POSN                        equ 0002h
B0EIDH_EID10_POSITION                    equ 0002h
B0EIDH_EID10_SIZE                        equ 0001h
B0EIDH_EID10_LENGTH                      equ 0001h
B0EIDH_EID10_MASK                        equ 0004h
B0EIDH_EID11_POSN                        equ 0003h
B0EIDH_EID11_POSITION                    equ 0003h
B0EIDH_EID11_SIZE                        equ 0001h
B0EIDH_EID11_LENGTH                      equ 0001h
B0EIDH_EID11_MASK                        equ 0008h
B0EIDH_EID12_POSN                        equ 0004h
B0EIDH_EID12_POSITION                    equ 0004h
B0EIDH_EID12_SIZE                        equ 0001h
B0EIDH_EID12_LENGTH                      equ 0001h
B0EIDH_EID12_MASK                        equ 0010h
B0EIDH_EID13_POSN                        equ 0005h
B0EIDH_EID13_POSITION                    equ 0005h
B0EIDH_EID13_SIZE                        equ 0001h
B0EIDH_EID13_LENGTH                      equ 0001h
B0EIDH_EID13_MASK                        equ 0020h
B0EIDH_EID14_POSN                        equ 0006h
B0EIDH_EID14_POSITION                    equ 0006h
B0EIDH_EID14_SIZE                        equ 0001h
B0EIDH_EID14_LENGTH                      equ 0001h
B0EIDH_EID14_MASK                        equ 0040h
B0EIDH_EID15_POSN                        equ 0007h
B0EIDH_EID15_POSITION                    equ 0007h
B0EIDH_EID15_SIZE                        equ 0001h
B0EIDH_EID15_LENGTH                      equ 0001h
B0EIDH_EID15_MASK                        equ 0080h
B0EIDH_EID_POSN                          equ 0000h
B0EIDH_EID_POSITION                      equ 0000h
B0EIDH_EID_SIZE                          equ 0008h
B0EIDH_EID_LENGTH                        equ 0008h
B0EIDH_EID_MASK                          equ 00FFh

// Register: B0EIDL
#define B0EIDL B0EIDL
B0EIDL                                   equ 03744h
// bitfield definitions
B0EIDL_EID0_POSN                         equ 0000h
B0EIDL_EID0_POSITION                     equ 0000h
B0EIDL_EID0_SIZE                         equ 0001h
B0EIDL_EID0_LENGTH                       equ 0001h
B0EIDL_EID0_MASK                         equ 0001h
B0EIDL_EID1_POSN                         equ 0001h
B0EIDL_EID1_POSITION                     equ 0001h
B0EIDL_EID1_SIZE                         equ 0001h
B0EIDL_EID1_LENGTH                       equ 0001h
B0EIDL_EID1_MASK                         equ 0002h
B0EIDL_EID2_POSN                         equ 0002h
B0EIDL_EID2_POSITION                     equ 0002h
B0EIDL_EID2_SIZE                         equ 0001h
B0EIDL_EID2_LENGTH                       equ 0001h
B0EIDL_EID2_MASK                         equ 0004h
B0EIDL_EID3_POSN                         equ 0003h
B0EIDL_EID3_POSITION                     equ 0003h
B0EIDL_EID3_SIZE                         equ 0001h
B0EIDL_EID3_LENGTH                       equ 0001h
B0EIDL_EID3_MASK                         equ 0008h
B0EIDL_EID4_POSN                         equ 0004h
B0EIDL_EID4_POSITION                     equ 0004h
B0EIDL_EID4_SIZE                         equ 0001h
B0EIDL_EID4_LENGTH                       equ 0001h
B0EIDL_EID4_MASK                         equ 0010h
B0EIDL_EID5_POSN                         equ 0005h
B0EIDL_EID5_POSITION                     equ 0005h
B0EIDL_EID5_SIZE                         equ 0001h
B0EIDL_EID5_LENGTH                       equ 0001h
B0EIDL_EID5_MASK                         equ 0020h
B0EIDL_EID6_POSN                         equ 0006h
B0EIDL_EID6_POSITION                     equ 0006h
B0EIDL_EID6_SIZE                         equ 0001h
B0EIDL_EID6_LENGTH                       equ 0001h
B0EIDL_EID6_MASK                         equ 0040h
B0EIDL_EID7_POSN                         equ 0007h
B0EIDL_EID7_POSITION                     equ 0007h
B0EIDL_EID7_SIZE                         equ 0001h
B0EIDL_EID7_LENGTH                       equ 0001h
B0EIDL_EID7_MASK                         equ 0080h
B0EIDL_EID_POSN                          equ 0000h
B0EIDL_EID_POSITION                      equ 0000h
B0EIDL_EID_SIZE                          equ 0008h
B0EIDL_EID_LENGTH                        equ 0008h
B0EIDL_EID_MASK                          equ 00FFh

