GopalSaraf/Practicals/PSDL/include/proc/pic18lf25k83.inc
// Register: B2SIDL
#define B2SIDL B2SIDL
B2SIDL                                   equ 03762h
// bitfield definitions
B2SIDL_EID16_POSN                        equ 0000h
B2SIDL_EID16_POSITION                    equ 0000h
B2SIDL_EID16_SIZE                        equ 0001h
B2SIDL_EID16_LENGTH                      equ 0001h
B2SIDL_EID16_MASK                        equ 0001h
B2SIDL_EID17_POSN                        equ 0001h
B2SIDL_EID17_POSITION                    equ 0001h
B2SIDL_EID17_SIZE                        equ 0001h
B2SIDL_EID17_LENGTH                      equ 0001h
B2SIDL_EID17_MASK                        equ 0002h
B2SIDL_EXIDE_POSN                        equ 0003h
B2SIDL_EXIDE_POSITION                    equ 0003h
B2SIDL_EXIDE_SIZE                        equ 0001h
B2SIDL_EXIDE_LENGTH                      equ 0001h
B2SIDL_EXIDE_MASK                        equ 0008h
B2SIDL_SRR_POSN                          equ 0004h
B2SIDL_SRR_POSITION                      equ 0004h
B2SIDL_SRR_SIZE                          equ 0001h
B2SIDL_SRR_LENGTH                        equ 0001h
B2SIDL_SRR_MASK                          equ 0010h
B2SIDL_SID0_POSN                         equ 0005h
B2SIDL_SID0_POSITION                     equ 0005h
B2SIDL_SID0_SIZE                         equ 0001h
B2SIDL_SID0_LENGTH                       equ 0001h
B2SIDL_SID0_MASK                         equ 0020h
B2SIDL_SID1_POSN                         equ 0006h
B2SIDL_SID1_POSITION                     equ 0006h
B2SIDL_SID1_SIZE                         equ 0001h
B2SIDL_SID1_LENGTH                       equ 0001h
B2SIDL_SID1_MASK                         equ 0040h
B2SIDL_SID2_POSN                         equ 0007h
B2SIDL_SID2_POSITION                     equ 0007h
B2SIDL_SID2_SIZE                         equ 0001h
B2SIDL_SID2_LENGTH                       equ 0001h
B2SIDL_SID2_MASK                         equ 0080h
B2SIDL_EID18_POSN                        equ 0005h
B2SIDL_EID18_POSITION                    equ 0005h
B2SIDL_EID18_SIZE                        equ 0001h
B2SIDL_EID18_LENGTH                      equ 0001h
B2SIDL_EID18_MASK                        equ 0020h
B2SIDL_EID19_POSN                        equ 0006h
B2SIDL_EID19_POSITION                    equ 0006h
B2SIDL_EID19_SIZE                        equ 0001h
B2SIDL_EID19_LENGTH                      equ 0001h
B2SIDL_EID19_MASK                        equ 0040h
B2SIDL_EID20_POSN                        equ 0007h
B2SIDL_EID20_POSITION                    equ 0007h
B2SIDL_EID20_SIZE                        equ 0001h
B2SIDL_EID20_LENGTH                      equ 0001h
B2SIDL_EID20_MASK                        equ 0080h
B2SIDL_EID_POSN                          equ 0000h
B2SIDL_EID_POSITION                      equ 0000h
B2SIDL_EID_SIZE                          equ 0002h
B2SIDL_EID_LENGTH                        equ 0002h
B2SIDL_EID_MASK                          equ 0003h
B2SIDL_SID_POSN                          equ 0005h
B2SIDL_SID_POSITION                      equ 0005h
B2SIDL_SID_SIZE                          equ 0003h
B2SIDL_SID_LENGTH                        equ 0003h
B2SIDL_SID_MASK                          equ 00E0h

// Register: B2EIDH
#define B2EIDH B2EIDH
B2EIDH                                   equ 03763h
// bitfield definitions
B2EIDH_EID8_POSN                         equ 0000h
B2EIDH_EID8_POSITION                     equ 0000h
B2EIDH_EID8_SIZE                         equ 0001h
B2EIDH_EID8_LENGTH                       equ 0001h
B2EIDH_EID8_MASK                         equ 0001h
B2EIDH_EID9_POSN                         equ 0001h
B2EIDH_EID9_POSITION                     equ 0001h
B2EIDH_EID9_SIZE                         equ 0001h
B2EIDH_EID9_LENGTH                       equ 0001h
B2EIDH_EID9_MASK                         equ 0002h
B2EIDH_EID10_POSN                        equ 0002h
B2EIDH_EID10_POSITION                    equ 0002h
B2EIDH_EID10_SIZE                        equ 0001h
B2EIDH_EID10_LENGTH                      equ 0001h
B2EIDH_EID10_MASK                        equ 0004h
B2EIDH_EID11_POSN                        equ 0003h
B2EIDH_EID11_POSITION                    equ 0003h
B2EIDH_EID11_SIZE                        equ 0001h
B2EIDH_EID11_LENGTH                      equ 0001h
B2EIDH_EID11_MASK                        equ 0008h
B2EIDH_EID12_POSN                        equ 0004h
B2EIDH_EID12_POSITION                    equ 0004h
B2EIDH_EID12_SIZE                        equ 0001h
B2EIDH_EID12_LENGTH                      equ 0001h
B2EIDH_EID12_MASK                        equ 0010h
B2EIDH_EID13_POSN                        equ 0005h
B2EIDH_EID13_POSITION                    equ 0005h
B2EIDH_EID13_SIZE                        equ 0001h
B2EIDH_EID13_LENGTH                      equ 0001h
B2EIDH_EID13_MASK                        equ 0020h
B2EIDH_EID14_POSN                        equ 0006h
B2EIDH_EID14_POSITION                    equ 0006h
B2EIDH_EID14_SIZE                        equ 0001h
B2EIDH_EID14_LENGTH                      equ 0001h
B2EIDH_EID14_MASK                        equ 0040h
B2EIDH_EID15_POSN                        equ 0007h
B2EIDH_EID15_POSITION                    equ 0007h
B2EIDH_EID15_SIZE                        equ 0001h
B2EIDH_EID15_LENGTH                      equ 0001h
B2EIDH_EID15_MASK                        equ 0080h
B2EIDH_EID_POSN                          equ 0000h
B2EIDH_EID_POSITION                      equ 0000h
B2EIDH_EID_SIZE                          equ 0008h
B2EIDH_EID_LENGTH                        equ 0008h
B2EIDH_EID_MASK                          equ 00FFh

// Register: B2EIDL
#define B2EIDL B2EIDL
B2EIDL                                   equ 03764h
// bitfield definitions
B2EIDL_EID0_POSN                         equ 0000h
B2EIDL_EID0_POSITION                     equ 0000h
B2EIDL_EID0_SIZE                         equ 0001h
B2EIDL_EID0_LENGTH                       equ 0001h
B2EIDL_EID0_MASK                         equ 0001h
B2EIDL_EID1_POSN                         equ 0001h
B2EIDL_EID1_POSITION                     equ 0001h
B2EIDL_EID1_SIZE                         equ 0001h
B2EIDL_EID1_LENGTH                       equ 0001h
B2EIDL_EID1_MASK                         equ 0002h
B2EIDL_EID2_POSN                         equ 0002h
B2EIDL_EID2_POSITION                     equ 0002h
B2EIDL_EID2_SIZE                         equ 0001h
B2EIDL_EID2_LENGTH                       equ 0001h
B2EIDL_EID2_MASK                         equ 0004h
B2EIDL_EID3_POSN                         equ 0003h
B2EIDL_EID3_POSITION                     equ 0003h
B2EIDL_EID3_SIZE                         equ 0001h
B2EIDL_EID3_LENGTH                       equ 0001h
B2EIDL_EID3_MASK                         equ 0008h
B2EIDL_EID4_POSN                         equ 0004h
B2EIDL_EID4_POSITION                     equ 0004h
B2EIDL_EID4_SIZE                         equ 0001h
B2EIDL_EID4_LENGTH                       equ 0001h
B2EIDL_EID4_MASK                         equ 0010h
B2EIDL_EID5_POSN                         equ 0005h
B2EIDL_EID5_POSITION                     equ 0005h
B2EIDL_EID5_SIZE                         equ 0001h
B2EIDL_EID5_LENGTH                       equ 0001h
B2EIDL_EID5_MASK                         equ 0020h
B2EIDL_EID6_POSN                         equ 0006h
B2EIDL_EID6_POSITION                     equ 0006h
B2EIDL_EID6_SIZE                         equ 0001h
B2EIDL_EID6_LENGTH                       equ 0001h
B2EIDL_EID6_MASK                         equ 0040h
B2EIDL_EID7_POSN                         equ 0007h
B2EIDL_EID7_POSITION                     equ 0007h
B2EIDL_EID7_SIZE                         equ 0001h
B2EIDL_EID7_LENGTH                       equ 0001h
B2EIDL_EID7_MASK                         equ 0080h
B2EIDL_EID_POSN                          equ 0000h
B2EIDL_EID_POSITION                      equ 0000h
B2EIDL_EID_SIZE                          equ 0008h
B2EIDL_EID_LENGTH                        equ 0008h
B2EIDL_EID_MASK                          equ 00FFh

// Register: B2DLC
#define B2DLC B2DLC
B2DLC                                    equ 03765h
// bitfield definitions
B2DLC_DLC0_POSN                          equ 0000h
B2DLC_DLC0_POSITION                      equ 0000h
B2DLC_DLC0_SIZE                          equ 0001h
B2DLC_DLC0_LENGTH                        equ 0001h
B2DLC_DLC0_MASK                          equ 0001h
B2DLC_DLC1_POSN                          equ 0001h
B2DLC_DLC1_POSITION                      equ 0001h
B2DLC_DLC1_SIZE                          equ 0001h
B2DLC_DLC1_LENGTH                        equ 0001h
B2DLC_DLC1_MASK                          equ 0002h
B2DLC_DLC2_POSN                          equ 0002h
B2DLC_DLC2_POSITION                      equ 0002h
B2DLC_DLC2_SIZE                          equ 0001h
B2DLC_DLC2_LENGTH                        equ 0001h
B2DLC_DLC2_MASK                          equ 0004h
B2DLC_DLC3_POSN                          equ 0003h
B2DLC_DLC3_POSITION                      equ 0003h
B2DLC_DLC3_SIZE                          equ 0001h
B2DLC_DLC3_LENGTH                        equ 0001h
B2DLC_DLC3_MASK                          equ 0008h
B2DLC_RB0_POSN                           equ 0004h
B2DLC_RB0_POSITION                       equ 0004h
B2DLC_RB0_SIZE                           equ 0001h
B2DLC_RB0_LENGTH                         equ 0001h
B2DLC_RB0_MASK                           equ 0010h
B2DLC_RB1_POSN                           equ 0005h
B2DLC_RB1_POSITION                       equ 0005h
B2DLC_RB1_SIZE                           equ 0001h
B2DLC_RB1_LENGTH                         equ 0001h
B2DLC_RB1_MASK                           equ 0020h
B2DLC_RXRTR_TX_POSN                      equ 0006h
B2DLC_RXRTR_TX_POSITION                  equ 0006h
B2DLC_RXRTR_TX_SIZE                      equ 0001h
B2DLC_RXRTR_TX_LENGTH                    equ 0001h
B2DLC_RXRTR_TX_MASK                      equ 0040h
B2DLC_DLC_POSN                           equ 0000h
B2DLC_DLC_POSITION                       equ 0000h
B2DLC_DLC_SIZE                           equ 0004h
B2DLC_DLC_LENGTH                         equ 0004h
B2DLC_DLC_MASK                           equ 000Fh
B2DLC_RB_POSN                            equ 0004h
B2DLC_RB_POSITION                        equ 0004h
B2DLC_RB_SIZE                            equ 0002h
B2DLC_RB_LENGTH                          equ 0002h
B2DLC_RB_MASK                            equ 0030h
B2DLC_RXRTR_POSN                         equ 0006h
B2DLC_RXRTR_POSITION                     equ 0006h
B2DLC_RXRTR_SIZE                         equ 0001h
B2DLC_RXRTR_LENGTH                       equ 0001h
B2DLC_RXRTR_MASK                         equ 0040h
B2DLC_TXRTR_POSN                         equ 0006h
B2DLC_TXRTR_POSITION                     equ 0006h
B2DLC_TXRTR_SIZE                         equ 0001h
B2DLC_TXRTR_LENGTH                       equ 0001h
B2DLC_TXRTR_MASK                         equ 0040h

// Register: B2D0
#define B2D0 B2D0
B2D0                                     equ 03766h
// bitfield definitions
B2D0_B2D0_POSN                           equ 0000h
B2D0_B2D0_POSITION                       equ 0000h
B2D0_B2D0_SIZE                           equ 0008h
B2D0_B2D0_LENGTH                         equ 0008h
B2D0_B2D0_MASK                           equ 00FFh
B2D0_B2D00_POSN                          equ 0000h
B2D0_B2D00_POSITION                      equ 0000h
B2D0_B2D00_SIZE                          equ 0001h
B2D0_B2D00_LENGTH                        equ 0001h
B2D0_B2D00_MASK                          equ 0001h
B2D0_B2D01_POSN                          equ 0001h
B2D0_B2D01_POSITION                      equ 0001h
B2D0_B2D01_SIZE                          equ 0001h
B2D0_B2D01_LENGTH                        equ 0001h
B2D0_B2D01_MASK                          equ 0002h
B2D0_B2D02_POSN                          equ 0002h
B2D0_B2D02_POSITION                      equ 0002h
B2D0_B2D02_SIZE                          equ 0001h
B2D0_B2D02_LENGTH                        equ 0001h
B2D0_B2D02_MASK                          equ 0004h
B2D0_B2D03_POSN                          equ 0003h
B2D0_B2D03_POSITION                      equ 0003h
B2D0_B2D03_SIZE                          equ 0001h
B2D0_B2D03_LENGTH                        equ 0001h
B2D0_B2D03_MASK                          equ 0008h
B2D0_B2D04_POSN                          equ 0004h
B2D0_B2D04_POSITION                      equ 0004h
B2D0_B2D04_SIZE                          equ 0001h
B2D0_B2D04_LENGTH                        equ 0001h
B2D0_B2D04_MASK                          equ 0010h
B2D0_B2D05_POSN                          equ 0005h
B2D0_B2D05_POSITION                      equ 0005h
B2D0_B2D05_SIZE                          equ 0001h
B2D0_B2D05_LENGTH                        equ 0001h
B2D0_B2D05_MASK                          equ 0020h
B2D0_B2D06_POSN                          equ 0006h
B2D0_B2D06_POSITION                      equ 0006h
B2D0_B2D06_SIZE                          equ 0001h
B2D0_B2D06_LENGTH                        equ 0001h
B2D0_B2D06_MASK                          equ 0040h
B2D0_B2D07_POSN                          equ 0007h
B2D0_B2D07_POSITION                      equ 0007h
B2D0_B2D07_SIZE                          equ 0001h
B2D0_B2D07_LENGTH                        equ 0001h
B2D0_B2D07_MASK                          equ 0080h

// Register: B2D1
#define B2D1 B2D1
B2D1                                     equ 03767h
// bitfield definitions
B2D1_B2D1_POSN                           equ 0000h
B2D1_B2D1_POSITION                       equ 0000h
B2D1_B2D1_SIZE                           equ 0008h
B2D1_B2D1_LENGTH                         equ 0008h
B2D1_B2D1_MASK                           equ 00FFh
B2D1_B2D10_POSN                          equ 0000h
B2D1_B2D10_POSITION                      equ 0000h
B2D1_B2D10_SIZE                          equ 0001h
B2D1_B2D10_LENGTH                        equ 0001h
B2D1_B2D10_MASK                          equ 0001h
B2D1_B2D11_POSN                          equ 0001h
B2D1_B2D11_POSITION                      equ 0001h
B2D1_B2D11_SIZE                          equ 0001h
B2D1_B2D11_LENGTH                        equ 0001h
B2D1_B2D11_MASK                          equ 0002h
B2D1_B2D12_POSN                          equ 0002h
B2D1_B2D12_POSITION                      equ 0002h
B2D1_B2D12_SIZE                          equ 0001h
B2D1_B2D12_LENGTH                        equ 0001h
B2D1_B2D12_MASK                          equ 0004h
B2D1_B2D13_POSN                          equ 0003h
B2D1_B2D13_POSITION                      equ 0003h
B2D1_B2D13_SIZE                          equ 0001h
B2D1_B2D13_LENGTH                        equ 0001h
B2D1_B2D13_MASK                          equ 0008h
B2D1_B2D14_POSN                          equ 0004h
B2D1_B2D14_POSITION                      equ 0004h
B2D1_B2D14_SIZE                          equ 0001h
B2D1_B2D14_LENGTH                        equ 0001h
B2D1_B2D14_MASK                          equ 0010h
B2D1_B2D15_POSN                          equ 0005h
B2D1_B2D15_POSITION                      equ 0005h
B2D1_B2D15_SIZE                          equ 0001h
B2D1_B2D15_LENGTH                        equ 0001h
B2D1_B2D15_MASK                          equ 0020h
B2D1_B2D16_POSN                          equ 0006h
B2D1_B2D16_POSITION                      equ 0006h
B2D1_B2D16_SIZE                          equ 0001h
B2D1_B2D16_LENGTH                        equ 0001h
B2D1_B2D16_MASK                          equ 0040h
B2D1_B2D17_POSN                          equ 0007h
B2D1_B2D17_POSITION                      equ 0007h
B2D1_B2D17_SIZE                          equ 0001h
B2D1_B2D17_LENGTH                        equ 0001h
B2D1_B2D17_MASK                          equ 0080h

// Register: B2D2
#define B2D2 B2D2
B2D2                                     equ 03768h
// bitfield definitions
B2D2_B2D2_POSN                           equ 0000h
B2D2_B2D2_POSITION                       equ 0000h
B2D2_B2D2_SIZE                           equ 0008h
B2D2_B2D2_LENGTH                         equ 0008h
B2D2_B2D2_MASK                           equ 00FFh
B2D2_B2D20_POSN                          equ 0000h
B2D2_B2D20_POSITION                      equ 0000h
B2D2_B2D20_SIZE                          equ 0001h
B2D2_B2D20_LENGTH                        equ 0001h
B2D2_B2D20_MASK                          equ 0001h
B2D2_B2D21_POSN                          equ 0001h
B2D2_B2D21_POSITION                      equ 0001h
B2D2_B2D21_SIZE                          equ 0001h
B2D2_B2D21_LENGTH                        equ 0001h
B2D2_B2D21_MASK                          equ 0002h
B2D2_B2D22_POSN                          equ 0002h
B2D2_B2D22_POSITION                      equ 0002h
B2D2_B2D22_SIZE                          equ 0001h
B2D2_B2D22_LENGTH                        equ 0001h
B2D2_B2D22_MASK                          equ 0004h
B2D2_B2D23_POSN                          equ 0003h
B2D2_B2D23_POSITION                      equ 0003h
B2D2_B2D23_SIZE                          equ 0001h
B2D2_B2D23_LENGTH                        equ 0001h
B2D2_B2D23_MASK                          equ 0008h
B2D2_B2D24_POSN                          equ 0004h
B2D2_B2D24_POSITION                      equ 0004h
B2D2_B2D24_SIZE                          equ 0001h
B2D2_B2D24_LENGTH                        equ 0001h
B2D2_B2D24_MASK                          equ 0010h
B2D2_B2D25_POSN                          equ 0005h
B2D2_B2D25_POSITION                      equ 0005h
B2D2_B2D25_SIZE                          equ 0001h
B2D2_B2D25_LENGTH                        equ 0001h
B2D2_B2D25_MASK                          equ 0020h
B2D2_B2D26_POSN                          equ 0006h
B2D2_B2D26_POSITION                      equ 0006h
B2D2_B2D26_SIZE                          equ 0001h
B2D2_B2D26_LENGTH                        equ 0001h
B2D2_B2D26_MASK                          equ 0040h
B2D2_B2D27_POSN                          equ 0007h
B2D2_B2D27_POSITION                      equ 0007h
B2D2_B2D27_SIZE                          equ 0001h
B2D2_B2D27_LENGTH                        equ 0001h
B2D2_B2D27_MASK                          equ 0080h

// Register: B2D3
#define B2D3 B2D3
B2D3                                     equ 03769h
// bitfield definitions
B2D3_B2D3_POSN                           equ 0000h
B2D3_B2D3_POSITION                       equ 0000h
B2D3_B2D3_SIZE                           equ 0008h
B2D3_B2D3_LENGTH                         equ 0008h
B2D3_B2D3_MASK                           equ 00FFh
B2D3_B2D30_POSN                          equ 0000h
B2D3_B2D30_POSITION                      equ 0000h
B2D3_B2D30_SIZE                          equ 0001h
B2D3_B2D30_LENGTH                        equ 0001h
B2D3_B2D30_MASK                          equ 0001h
B2D3_B2D31_POSN                          equ 0001h
B2D3_B2D31_POSITION                      equ 0001h
B2D3_B2D31_SIZE                          equ 0001h
B2D3_B2D31_LENGTH                        equ 0001h
B2D3_B2D31_MASK                          equ 0002h
B2D3_B2D32_POSN                          equ 0002h
B2D3_B2D32_POSITION                      equ 0002h
B2D3_B2D32_SIZE                          equ 0001h
B2D3_B2D32_LENGTH                        equ 0001h
B2D3_B2D32_MASK                          equ 0004h
B2D3_B2D33_POSN                          equ 0003h
B2D3_B2D33_POSITION                      equ 0003h
B2D3_B2D33_SIZE                          equ 0001h
B2D3_B2D33_LENGTH                        equ 0001h
B2D3_B2D33_MASK                          equ 0008h
B2D3_B2D34_POSN                          equ 0004h
B2D3_B2D34_POSITION                      equ 0004h
B2D3_B2D34_SIZE                          equ 0001h
B2D3_B2D34_LENGTH                        equ 0001h
B2D3_B2D34_MASK                          equ 0010h
B2D3_B2D35_POSN                          equ 0005h
B2D3_B2D35_POSITION                      equ 0005h
B2D3_B2D35_SIZE                          equ 0001h
B2D3_B2D35_LENGTH                        equ 0001h
B2D3_B2D35_MASK                          equ 0020h
B2D3_B2D36_POSN                          equ 0006h
B2D3_B2D36_POSITION                      equ 0006h
B2D3_B2D36_SIZE                          equ 0001h
B2D3_B2D36_LENGTH                        equ 0001h
B2D3_B2D36_MASK                          equ 0040h
B2D3_B2D37_POSN                          equ 0007h
B2D3_B2D37_POSITION                      equ 0007h
B2D3_B2D37_SIZE                          equ 0001h
B2D3_B2D37_LENGTH                        equ 0001h
B2D3_B2D37_MASK                          equ 0080h

