GopalSaraf/Practicals/PSDL/include/proc/pic18lf25k83.inc
// Register: B3CON
#define B3CON B3CON
B3CON                                    equ 03770h
// bitfield definitions
B3CON_FILHIT0_TXPRI0_POSN                equ 0000h
B3CON_FILHIT0_TXPRI0_POSITION            equ 0000h
B3CON_FILHIT0_TXPRI0_SIZE                equ 0001h
B3CON_FILHIT0_TXPRI0_LENGTH              equ 0001h
B3CON_FILHIT0_TXPRI0_MASK                equ 0001h
B3CON_FILHIT1_TXPRI1_POSN                equ 0001h
B3CON_FILHIT1_TXPRI1_POSITION            equ 0001h
B3CON_FILHIT1_TXPRI1_SIZE                equ 0001h
B3CON_FILHIT1_TXPRI1_LENGTH              equ 0001h
B3CON_FILHIT1_TXPRI1_MASK                equ 0002h
B3CON_FILHIT2_RTREN_POSN                 equ 0002h
B3CON_FILHIT2_RTREN_POSITION             equ 0002h
B3CON_FILHIT2_RTREN_SIZE                 equ 0001h
B3CON_FILHIT2_RTREN_LENGTH               equ 0001h
B3CON_FILHIT2_RTREN_MASK                 equ 0004h
B3CON_FILHIT3_TXREQ_POSN                 equ 0003h
B3CON_FILHIT3_TXREQ_POSITION             equ 0003h
B3CON_FILHIT3_TXREQ_SIZE                 equ 0001h
B3CON_FILHIT3_TXREQ_LENGTH               equ 0001h
B3CON_FILHIT3_TXREQ_MASK                 equ 0008h
B3CON_FILHIT4_TXERR_POSN                 equ 0004h
B3CON_FILHIT4_TXERR_POSITION             equ 0004h
B3CON_FILHIT4_TXERR_SIZE                 equ 0001h
B3CON_FILHIT4_TXERR_LENGTH               equ 0001h
B3CON_FILHIT4_TXERR_MASK                 equ 0010h
B3CON_RXRTRRO_TXLARB_POSN                equ 0005h
B3CON_RXRTRRO_TXLARB_POSITION            equ 0005h
B3CON_RXRTRRO_TXLARB_SIZE                equ 0001h
B3CON_RXRTRRO_TXLARB_LENGTH              equ 0001h
B3CON_RXRTRRO_TXLARB_MASK                equ 0020h
B3CON_RXM1_TXABT_POSN                    equ 0006h
B3CON_RXM1_TXABT_POSITION                equ 0006h
B3CON_RXM1_TXABT_SIZE                    equ 0001h
B3CON_RXM1_TXABT_LENGTH                  equ 0001h
B3CON_RXM1_TXABT_MASK                    equ 0040h
B3CON_RXFUL_TXBIF_POSN                   equ 0007h
B3CON_RXFUL_TXBIF_POSITION               equ 0007h
B3CON_RXFUL_TXBIF_SIZE                   equ 0001h
B3CON_RXFUL_TXBIF_LENGTH                 equ 0001h
B3CON_RXFUL_TXBIF_MASK                   equ 0080h
B3CON_FILHIT0_POSN                       equ 0000h
B3CON_FILHIT0_POSITION                   equ 0000h
B3CON_FILHIT0_SIZE                       equ 0001h
B3CON_FILHIT0_LENGTH                     equ 0001h
B3CON_FILHIT0_MASK                       equ 0001h
B3CON_FILHIT1_POSN                       equ 0001h
B3CON_FILHIT1_POSITION                   equ 0001h
B3CON_FILHIT1_SIZE                       equ 0001h
B3CON_FILHIT1_LENGTH                     equ 0001h
B3CON_FILHIT1_MASK                       equ 0002h
B3CON_FILHIT2_POSN                       equ 0002h
B3CON_FILHIT2_POSITION                   equ 0002h
B3CON_FILHIT2_SIZE                       equ 0001h
B3CON_FILHIT2_LENGTH                     equ 0001h
B3CON_FILHIT2_MASK                       equ 0004h
B3CON_FILHIT3_POSN                       equ 0003h
B3CON_FILHIT3_POSITION                   equ 0003h
B3CON_FILHIT3_SIZE                       equ 0001h
B3CON_FILHIT3_LENGTH                     equ 0001h
B3CON_FILHIT3_MASK                       equ 0008h
B3CON_FILHIT4_POSN                       equ 0004h
B3CON_FILHIT4_POSITION                   equ 0004h
B3CON_FILHIT4_SIZE                       equ 0001h
B3CON_FILHIT4_LENGTH                     equ 0001h
B3CON_FILHIT4_MASK                       equ 0010h
B3CON_RXRTRRO_POSN                       equ 0005h
B3CON_RXRTRRO_POSITION                   equ 0005h
B3CON_RXRTRRO_SIZE                       equ 0001h
B3CON_RXRTRRO_LENGTH                     equ 0001h
B3CON_RXRTRRO_MASK                       equ 0020h
B3CON_RXM1_POSN                          equ 0006h
B3CON_RXM1_POSITION                      equ 0006h
B3CON_RXM1_SIZE                          equ 0001h
B3CON_RXM1_LENGTH                        equ 0001h
B3CON_RXM1_MASK                          equ 0040h
B3CON_RXFUL_POSN                         equ 0007h
B3CON_RXFUL_POSITION                     equ 0007h
B3CON_RXFUL_SIZE                         equ 0001h
B3CON_RXFUL_LENGTH                       equ 0001h
B3CON_RXFUL_MASK                         equ 0080h
B3CON_TXPRI0_POSN                        equ 0000h
B3CON_TXPRI0_POSITION                    equ 0000h
B3CON_TXPRI0_SIZE                        equ 0001h
B3CON_TXPRI0_LENGTH                      equ 0001h
B3CON_TXPRI0_MASK                        equ 0001h
B3CON_TXPRI1_POSN                        equ 0001h
B3CON_TXPRI1_POSITION                    equ 0001h
B3CON_TXPRI1_SIZE                        equ 0001h
B3CON_TXPRI1_LENGTH                      equ 0001h
B3CON_TXPRI1_MASK                        equ 0002h
B3CON_RTREN_POSN                         equ 0002h
B3CON_RTREN_POSITION                     equ 0002h
B3CON_RTREN_SIZE                         equ 0001h
B3CON_RTREN_LENGTH                       equ 0001h
B3CON_RTREN_MASK                         equ 0004h
B3CON_TXREQ_POSN                         equ 0003h
B3CON_TXREQ_POSITION                     equ 0003h
B3CON_TXREQ_SIZE                         equ 0001h
B3CON_TXREQ_LENGTH                       equ 0001h
B3CON_TXREQ_MASK                         equ 0008h
B3CON_TXERR_POSN                         equ 0004h
B3CON_TXERR_POSITION                     equ 0004h
B3CON_TXERR_SIZE                         equ 0001h
B3CON_TXERR_LENGTH                       equ 0001h
B3CON_TXERR_MASK                         equ 0010h
B3CON_TXLARB_POSN                        equ 0005h
B3CON_TXLARB_POSITION                    equ 0005h
B3CON_TXLARB_SIZE                        equ 0001h
B3CON_TXLARB_LENGTH                      equ 0001h
B3CON_TXLARB_MASK                        equ 0020h
B3CON_TXABT_POSN                         equ 0006h
B3CON_TXABT_POSITION                     equ 0006h
B3CON_TXABT_SIZE                         equ 0001h
B3CON_TXABT_LENGTH                       equ 0001h
B3CON_TXABT_MASK                         equ 0040h
B3CON_TXBIF_POSN                         equ 0007h
B3CON_TXBIF_POSITION                     equ 0007h
B3CON_TXBIF_SIZE                         equ 0001h
B3CON_TXBIF_LENGTH                       equ 0001h
B3CON_TXBIF_MASK                         equ 0080h
B3CON_FILHIT_POSN                        equ 0000h
B3CON_FILHIT_POSITION                    equ 0000h
B3CON_FILHIT_SIZE                        equ 0005h
B3CON_FILHIT_LENGTH                      equ 0005h
B3CON_FILHIT_MASK                        equ 001Fh
B3CON_TXPRI_POSN                         equ 0000h
B3CON_TXPRI_POSITION                     equ 0000h
B3CON_TXPRI_SIZE                         equ 0002h
B3CON_TXPRI_LENGTH                       equ 0002h
B3CON_TXPRI_MASK                         equ 0003h

// Register: B3SIDH
#define B3SIDH B3SIDH
B3SIDH                                   equ 03771h
// bitfield definitions
B3SIDH_SID3_POSN                         equ 0000h
B3SIDH_SID3_POSITION                     equ 0000h
B3SIDH_SID3_SIZE                         equ 0001h
B3SIDH_SID3_LENGTH                       equ 0001h
B3SIDH_SID3_MASK                         equ 0001h
B3SIDH_SID4_POSN                         equ 0001h
B3SIDH_SID4_POSITION                     equ 0001h
B3SIDH_SID4_SIZE                         equ 0001h
B3SIDH_SID4_LENGTH                       equ 0001h
B3SIDH_SID4_MASK                         equ 0002h
B3SIDH_SID5_POSN                         equ 0002h
B3SIDH_SID5_POSITION                     equ 0002h
B3SIDH_SID5_SIZE                         equ 0001h
B3SIDH_SID5_LENGTH                       equ 0001h
B3SIDH_SID5_MASK                         equ 0004h
B3SIDH_SID6_POSN                         equ 0003h
B3SIDH_SID6_POSITION                     equ 0003h
B3SIDH_SID6_SIZE                         equ 0001h
B3SIDH_SID6_LENGTH                       equ 0001h
B3SIDH_SID6_MASK                         equ 0008h
B3SIDH_SID7_POSN                         equ 0004h
B3SIDH_SID7_POSITION                     equ 0004h
B3SIDH_SID7_SIZE                         equ 0001h
B3SIDH_SID7_LENGTH                       equ 0001h
B3SIDH_SID7_MASK                         equ 0010h
B3SIDH_SID8_POSN                         equ 0005h
B3SIDH_SID8_POSITION                     equ 0005h
B3SIDH_SID8_SIZE                         equ 0001h
B3SIDH_SID8_LENGTH                       equ 0001h
B3SIDH_SID8_MASK                         equ 0020h
B3SIDH_SID9_POSN                         equ 0006h
B3SIDH_SID9_POSITION                     equ 0006h
B3SIDH_SID9_SIZE                         equ 0001h
B3SIDH_SID9_LENGTH                       equ 0001h
B3SIDH_SID9_MASK                         equ 0040h
B3SIDH_SID10_POSN                        equ 0007h
B3SIDH_SID10_POSITION                    equ 0007h
B3SIDH_SID10_SIZE                        equ 0001h
B3SIDH_SID10_LENGTH                      equ 0001h
B3SIDH_SID10_MASK                        equ 0080h
B3SIDH_EID21_POSN                        equ 0000h
B3SIDH_EID21_POSITION                    equ 0000h
B3SIDH_EID21_SIZE                        equ 0001h
B3SIDH_EID21_LENGTH                      equ 0001h
B3SIDH_EID21_MASK                        equ 0001h
B3SIDH_EID22_POSN                        equ 0001h
B3SIDH_EID22_POSITION                    equ 0001h
B3SIDH_EID22_SIZE                        equ 0001h
B3SIDH_EID22_LENGTH                      equ 0001h
B3SIDH_EID22_MASK                        equ 0002h
B3SIDH_EID23_POSN                        equ 0002h
B3SIDH_EID23_POSITION                    equ 0002h
B3SIDH_EID23_SIZE                        equ 0001h
B3SIDH_EID23_LENGTH                      equ 0001h
B3SIDH_EID23_MASK                        equ 0004h
B3SIDH_EID24_POSN                        equ 0003h
B3SIDH_EID24_POSITION                    equ 0003h
B3SIDH_EID24_SIZE                        equ 0001h
B3SIDH_EID24_LENGTH                      equ 0001h
B3SIDH_EID24_MASK                        equ 0008h
B3SIDH_EID25_POSN                        equ 0004h
B3SIDH_EID25_POSITION                    equ 0004h
B3SIDH_EID25_SIZE                        equ 0001h
B3SIDH_EID25_LENGTH                      equ 0001h
B3SIDH_EID25_MASK                        equ 0010h
B3SIDH_EID26_POSN                        equ 0005h
B3SIDH_EID26_POSITION                    equ 0005h
B3SIDH_EID26_SIZE                        equ 0001h
B3SIDH_EID26_LENGTH                      equ 0001h
B3SIDH_EID26_MASK                        equ 0020h
B3SIDH_EID27_POSN                        equ 0006h
B3SIDH_EID27_POSITION                    equ 0006h
B3SIDH_EID27_SIZE                        equ 0001h
B3SIDH_EID27_LENGTH                      equ 0001h
B3SIDH_EID27_MASK                        equ 0040h
B3SIDH_EID28_POSN                        equ 0007h
B3SIDH_EID28_POSITION                    equ 0007h
B3SIDH_EID28_SIZE                        equ 0001h
B3SIDH_EID28_LENGTH                      equ 0001h
B3SIDH_EID28_MASK                        equ 0080h
B3SIDH_SID_POSN                          equ 0000h
B3SIDH_SID_POSITION                      equ 0000h
B3SIDH_SID_SIZE                          equ 0008h
B3SIDH_SID_LENGTH                        equ 0008h
B3SIDH_SID_MASK                          equ 00FFh

