GopalSaraf/Practicals/PSDL/include/proc/pic18lf25k83.inc
// Register: CANCON_RO6
#define CANCON_RO6 CANCON_RO6
CANCON_RO6                               equ 0377Fh
// bitfield definitions
CANCON_RO6_FP0_POSN                      equ 0000h
CANCON_RO6_FP0_POSITION                  equ 0000h
CANCON_RO6_FP0_SIZE                      equ 0001h
CANCON_RO6_FP0_LENGTH                    equ 0001h
CANCON_RO6_FP0_MASK                      equ 0001h
CANCON_RO6_WIN0_FP1_POSN                 equ 0001h
CANCON_RO6_WIN0_FP1_POSITION             equ 0001h
CANCON_RO6_WIN0_FP1_SIZE                 equ 0001h
CANCON_RO6_WIN0_FP1_LENGTH               equ 0001h
CANCON_RO6_WIN0_FP1_MASK                 equ 0002h
CANCON_RO6_WIN1_FP2_POSN                 equ 0002h
CANCON_RO6_WIN1_FP2_POSITION             equ 0002h
CANCON_RO6_WIN1_FP2_SIZE                 equ 0001h
CANCON_RO6_WIN1_FP2_LENGTH               equ 0001h
CANCON_RO6_WIN1_FP2_MASK                 equ 0004h
CANCON_RO6_WIN2_FP3_POSN                 equ 0003h
CANCON_RO6_WIN2_FP3_POSITION             equ 0003h
CANCON_RO6_WIN2_FP3_SIZE                 equ 0001h
CANCON_RO6_WIN2_FP3_LENGTH               equ 0001h
CANCON_RO6_WIN2_FP3_MASK                 equ 0008h
CANCON_RO6_ABAT_POSN                     equ 0004h
CANCON_RO6_ABAT_POSITION                 equ 0004h
CANCON_RO6_ABAT_SIZE                     equ 0001h
CANCON_RO6_ABAT_LENGTH                   equ 0001h
CANCON_RO6_ABAT_MASK                     equ 0010h
CANCON_RO6_REQOP_POSN                    equ 0005h
CANCON_RO6_REQOP_POSITION                equ 0005h
CANCON_RO6_REQOP_SIZE                    equ 0003h
CANCON_RO6_REQOP_LENGTH                  equ 0003h
CANCON_RO6_REQOP_MASK                    equ 00E0h
CANCON_RO6_WIN0_POSN                     equ 0001h
CANCON_RO6_WIN0_POSITION                 equ 0001h
CANCON_RO6_WIN0_SIZE                     equ 0001h
CANCON_RO6_WIN0_LENGTH                   equ 0001h
CANCON_RO6_WIN0_MASK                     equ 0002h
CANCON_RO6_WIN1_POSN                     equ 0002h
CANCON_RO6_WIN1_POSITION                 equ 0002h
CANCON_RO6_WIN1_SIZE                     equ 0001h
CANCON_RO6_WIN1_LENGTH                   equ 0001h
CANCON_RO6_WIN1_MASK                     equ 0004h
CANCON_RO6_WIN2_POSN                     equ 0003h
CANCON_RO6_WIN2_POSITION                 equ 0003h
CANCON_RO6_WIN2_SIZE                     equ 0001h
CANCON_RO6_WIN2_LENGTH                   equ 0001h
CANCON_RO6_WIN2_MASK                     equ 0008h
CANCON_RO6_REQOP0_POSN                   equ 0005h
CANCON_RO6_REQOP0_POSITION               equ 0005h
CANCON_RO6_REQOP0_SIZE                   equ 0001h
CANCON_RO6_REQOP0_LENGTH                 equ 0001h
CANCON_RO6_REQOP0_MASK                   equ 0020h
CANCON_RO6_REQOP1_POSN                   equ 0006h
CANCON_RO6_REQOP1_POSITION               equ 0006h
CANCON_RO6_REQOP1_SIZE                   equ 0001h
CANCON_RO6_REQOP1_LENGTH                 equ 0001h
CANCON_RO6_REQOP1_MASK                   equ 0040h
CANCON_RO6_REQOP2_POSN                   equ 0007h
CANCON_RO6_REQOP2_POSITION               equ 0007h
CANCON_RO6_REQOP2_SIZE                   equ 0001h
CANCON_RO6_REQOP2_LENGTH                 equ 0001h
CANCON_RO6_REQOP2_MASK                   equ 0080h
CANCON_RO6_FP1_POSN                      equ 0001h
CANCON_RO6_FP1_POSITION                  equ 0001h
CANCON_RO6_FP1_SIZE                      equ 0001h
CANCON_RO6_FP1_LENGTH                    equ 0001h
CANCON_RO6_FP1_MASK                      equ 0002h
CANCON_RO6_FP2_POSN                      equ 0002h
CANCON_RO6_FP2_POSITION                  equ 0002h
CANCON_RO6_FP2_SIZE                      equ 0001h
CANCON_RO6_FP2_LENGTH                    equ 0001h
CANCON_RO6_FP2_MASK                      equ 0004h
CANCON_RO6_FP3_POSN                      equ 0003h
CANCON_RO6_FP3_POSITION                  equ 0003h
CANCON_RO6_FP3_SIZE                      equ 0001h
CANCON_RO6_FP3_LENGTH                    equ 0001h
CANCON_RO6_FP3_MASK                      equ 0008h
CANCON_RO6_WIN_POSN                      equ 0001h
CANCON_RO6_WIN_POSITION                  equ 0001h
CANCON_RO6_WIN_SIZE                      equ 0003h
CANCON_RO6_WIN_LENGTH                    equ 0003h
CANCON_RO6_WIN_MASK                      equ 000Eh
CANCON_RO6_FP_POSN                       equ 0000h
CANCON_RO6_FP_POSITION                   equ 0000h
CANCON_RO6_FP_SIZE                       equ 0004h
CANCON_RO6_FP_LENGTH                     equ 0004h
CANCON_RO6_FP_MASK                       equ 000Fh

// Register: B4CON
#define B4CON B4CON
B4CON                                    equ 03780h
// bitfield definitions
B4CON_FILHIT0_TXPRI0_POSN                equ 0000h
B4CON_FILHIT0_TXPRI0_POSITION            equ 0000h
B4CON_FILHIT0_TXPRI0_SIZE                equ 0001h
B4CON_FILHIT0_TXPRI0_LENGTH              equ 0001h
B4CON_FILHIT0_TXPRI0_MASK                equ 0001h
B4CON_FILHIT1_TXPRI1_POSN                equ 0001h
B4CON_FILHIT1_TXPRI1_POSITION            equ 0001h
B4CON_FILHIT1_TXPRI1_SIZE                equ 0001h
B4CON_FILHIT1_TXPRI1_LENGTH              equ 0001h
B4CON_FILHIT1_TXPRI1_MASK                equ 0002h
B4CON_FILHIT2_RTREN_POSN                 equ 0002h
B4CON_FILHIT2_RTREN_POSITION             equ 0002h
B4CON_FILHIT2_RTREN_SIZE                 equ 0001h
B4CON_FILHIT2_RTREN_LENGTH               equ 0001h
B4CON_FILHIT2_RTREN_MASK                 equ 0004h
B4CON_FILHIT3_TXREQ_POSN                 equ 0003h
B4CON_FILHIT3_TXREQ_POSITION             equ 0003h
B4CON_FILHIT3_TXREQ_SIZE                 equ 0001h
B4CON_FILHIT3_TXREQ_LENGTH               equ 0001h
B4CON_FILHIT3_TXREQ_MASK                 equ 0008h
B4CON_FILHIT4_TXERR_POSN                 equ 0004h
B4CON_FILHIT4_TXERR_POSITION             equ 0004h
B4CON_FILHIT4_TXERR_SIZE                 equ 0001h
B4CON_FILHIT4_TXERR_LENGTH               equ 0001h
B4CON_FILHIT4_TXERR_MASK                 equ 0010h
B4CON_RXRTRRO_TXLARB_POSN                equ 0005h
B4CON_RXRTRRO_TXLARB_POSITION            equ 0005h
B4CON_RXRTRRO_TXLARB_SIZE                equ 0001h
B4CON_RXRTRRO_TXLARB_LENGTH              equ 0001h
B4CON_RXRTRRO_TXLARB_MASK                equ 0020h
B4CON_RXM1_TXABT_POSN                    equ 0006h
B4CON_RXM1_TXABT_POSITION                equ 0006h
B4CON_RXM1_TXABT_SIZE                    equ 0001h
B4CON_RXM1_TXABT_LENGTH                  equ 0001h
B4CON_RXM1_TXABT_MASK                    equ 0040h
B4CON_RXFUL_TXBIF_POSN                   equ 0007h
B4CON_RXFUL_TXBIF_POSITION               equ 0007h
B4CON_RXFUL_TXBIF_SIZE                   equ 0001h
B4CON_RXFUL_TXBIF_LENGTH                 equ 0001h
B4CON_RXFUL_TXBIF_MASK                   equ 0080h
B4CON_FILHIT0_POSN                       equ 0000h
B4CON_FILHIT0_POSITION                   equ 0000h
B4CON_FILHIT0_SIZE                       equ 0001h
B4CON_FILHIT0_LENGTH                     equ 0001h
B4CON_FILHIT0_MASK                       equ 0001h
B4CON_FILHIT1_POSN                       equ 0001h
B4CON_FILHIT1_POSITION                   equ 0001h
B4CON_FILHIT1_SIZE                       equ 0001h
B4CON_FILHIT1_LENGTH                     equ 0001h
B4CON_FILHIT1_MASK                       equ 0002h
B4CON_FILHIT2_POSN                       equ 0002h
B4CON_FILHIT2_POSITION                   equ 0002h
B4CON_FILHIT2_SIZE                       equ 0001h
B4CON_FILHIT2_LENGTH                     equ 0001h
B4CON_FILHIT2_MASK                       equ 0004h
B4CON_FILHIT3_POSN                       equ 0003h
B4CON_FILHIT3_POSITION                   equ 0003h
B4CON_FILHIT3_SIZE                       equ 0001h
B4CON_FILHIT3_LENGTH                     equ 0001h
B4CON_FILHIT3_MASK                       equ 0008h
B4CON_FILHIT4_POSN                       equ 0004h
B4CON_FILHIT4_POSITION                   equ 0004h
B4CON_FILHIT4_SIZE                       equ 0001h
B4CON_FILHIT4_LENGTH                     equ 0001h
B4CON_FILHIT4_MASK                       equ 0010h
B4CON_RXRTRRO_POSN                       equ 0005h
B4CON_RXRTRRO_POSITION                   equ 0005h
B4CON_RXRTRRO_SIZE                       equ 0001h
B4CON_RXRTRRO_LENGTH                     equ 0001h
B4CON_RXRTRRO_MASK                       equ 0020h
B4CON_RXM1_POSN                          equ 0006h
B4CON_RXM1_POSITION                      equ 0006h
B4CON_RXM1_SIZE                          equ 0001h
B4CON_RXM1_LENGTH                        equ 0001h
B4CON_RXM1_MASK                          equ 0040h
B4CON_RXFUL_POSN                         equ 0007h
B4CON_RXFUL_POSITION                     equ 0007h
B4CON_RXFUL_SIZE                         equ 0001h
B4CON_RXFUL_LENGTH                       equ 0001h
B4CON_RXFUL_MASK                         equ 0080h
B4CON_TXPRI0_POSN                        equ 0000h
B4CON_TXPRI0_POSITION                    equ 0000h
B4CON_TXPRI0_SIZE                        equ 0001h
B4CON_TXPRI0_LENGTH                      equ 0001h
B4CON_TXPRI0_MASK                        equ 0001h
B4CON_TXPRI1_POSN                        equ 0001h
B4CON_TXPRI1_POSITION                    equ 0001h
B4CON_TXPRI1_SIZE                        equ 0001h
B4CON_TXPRI1_LENGTH                      equ 0001h
B4CON_TXPRI1_MASK                        equ 0002h
B4CON_RTREN_POSN                         equ 0002h
B4CON_RTREN_POSITION                     equ 0002h
B4CON_RTREN_SIZE                         equ 0001h
B4CON_RTREN_LENGTH                       equ 0001h
B4CON_RTREN_MASK                         equ 0004h
B4CON_TXREQ_POSN                         equ 0003h
B4CON_TXREQ_POSITION                     equ 0003h
B4CON_TXREQ_SIZE                         equ 0001h
B4CON_TXREQ_LENGTH                       equ 0001h
B4CON_TXREQ_MASK                         equ 0008h
B4CON_TXERR_POSN                         equ 0004h
B4CON_TXERR_POSITION                     equ 0004h
B4CON_TXERR_SIZE                         equ 0001h
B4CON_TXERR_LENGTH                       equ 0001h
B4CON_TXERR_MASK                         equ 0010h
B4CON_TXLARB_POSN                        equ 0005h
B4CON_TXLARB_POSITION                    equ 0005h
B4CON_TXLARB_SIZE                        equ 0001h
B4CON_TXLARB_LENGTH                      equ 0001h
B4CON_TXLARB_MASK                        equ 0020h
B4CON_TXABT_POSN                         equ 0006h
B4CON_TXABT_POSITION                     equ 0006h
B4CON_TXABT_SIZE                         equ 0001h
B4CON_TXABT_LENGTH                       equ 0001h
B4CON_TXABT_MASK                         equ 0040h
B4CON_TXBIF_POSN                         equ 0007h
B4CON_TXBIF_POSITION                     equ 0007h
B4CON_TXBIF_SIZE                         equ 0001h
B4CON_TXBIF_LENGTH                       equ 0001h
B4CON_TXBIF_MASK                         equ 0080h
B4CON_FILHIT_POSN                        equ 0000h
B4CON_FILHIT_POSITION                    equ 0000h
B4CON_FILHIT_SIZE                        equ 0005h
B4CON_FILHIT_LENGTH                      equ 0005h
B4CON_FILHIT_MASK                        equ 001Fh
B4CON_TXPRI_POSN                         equ 0000h
B4CON_TXPRI_POSITION                     equ 0000h
B4CON_TXPRI_SIZE                         equ 0002h
B4CON_TXPRI_LENGTH                       equ 0002h
B4CON_TXPRI_MASK                         equ 0003h

// Register: B4SIDH
#define B4SIDH B4SIDH
B4SIDH                                   equ 03781h
// bitfield definitions
B4SIDH_SID3_POSN                         equ 0000h
B4SIDH_SID3_POSITION                     equ 0000h
B4SIDH_SID3_SIZE                         equ 0001h
B4SIDH_SID3_LENGTH                       equ 0001h
B4SIDH_SID3_MASK                         equ 0001h
B4SIDH_SID4_POSN                         equ 0001h
B4SIDH_SID4_POSITION                     equ 0001h
B4SIDH_SID4_SIZE                         equ 0001h
B4SIDH_SID4_LENGTH                       equ 0001h
B4SIDH_SID4_MASK                         equ 0002h
B4SIDH_SID5_POSN                         equ 0002h
B4SIDH_SID5_POSITION                     equ 0002h
B4SIDH_SID5_SIZE                         equ 0001h
B4SIDH_SID5_LENGTH                       equ 0001h
B4SIDH_SID5_MASK                         equ 0004h
B4SIDH_SID6_POSN                         equ 0003h
B4SIDH_SID6_POSITION                     equ 0003h
B4SIDH_SID6_SIZE                         equ 0001h
B4SIDH_SID6_LENGTH                       equ 0001h
B4SIDH_SID6_MASK                         equ 0008h
B4SIDH_SID7_POSN                         equ 0004h
B4SIDH_SID7_POSITION                     equ 0004h
B4SIDH_SID7_SIZE                         equ 0001h
B4SIDH_SID7_LENGTH                       equ 0001h
B4SIDH_SID7_MASK                         equ 0010h
B4SIDH_SID8_POSN                         equ 0005h
B4SIDH_SID8_POSITION                     equ 0005h
B4SIDH_SID8_SIZE                         equ 0001h
B4SIDH_SID8_LENGTH                       equ 0001h
B4SIDH_SID8_MASK                         equ 0020h
B4SIDH_SID9_POSN                         equ 0006h
B4SIDH_SID9_POSITION                     equ 0006h
B4SIDH_SID9_SIZE                         equ 0001h
B4SIDH_SID9_LENGTH                       equ 0001h
B4SIDH_SID9_MASK                         equ 0040h
B4SIDH_SID10_POSN                        equ 0007h
B4SIDH_SID10_POSITION                    equ 0007h
B4SIDH_SID10_SIZE                        equ 0001h
B4SIDH_SID10_LENGTH                      equ 0001h
B4SIDH_SID10_MASK                        equ 0080h
B4SIDH_EID21_POSN                        equ 0000h
B4SIDH_EID21_POSITION                    equ 0000h
B4SIDH_EID21_SIZE                        equ 0001h
B4SIDH_EID21_LENGTH                      equ 0001h
B4SIDH_EID21_MASK                        equ 0001h
B4SIDH_EID22_POSN                        equ 0001h
B4SIDH_EID22_POSITION                    equ 0001h
B4SIDH_EID22_SIZE                        equ 0001h
B4SIDH_EID22_LENGTH                      equ 0001h
B4SIDH_EID22_MASK                        equ 0002h
B4SIDH_EID23_POSN                        equ 0002h
B4SIDH_EID23_POSITION                    equ 0002h
B4SIDH_EID23_SIZE                        equ 0001h
B4SIDH_EID23_LENGTH                      equ 0001h
B4SIDH_EID23_MASK                        equ 0004h
B4SIDH_EID24_POSN                        equ 0003h
B4SIDH_EID24_POSITION                    equ 0003h
B4SIDH_EID24_SIZE                        equ 0001h
B4SIDH_EID24_LENGTH                      equ 0001h
B4SIDH_EID24_MASK                        equ 0008h
B4SIDH_EID25_POSN                        equ 0004h
B4SIDH_EID25_POSITION                    equ 0004h
B4SIDH_EID25_SIZE                        equ 0001h
B4SIDH_EID25_LENGTH                      equ 0001h
B4SIDH_EID25_MASK                        equ 0010h
B4SIDH_EID26_POSN                        equ 0005h
B4SIDH_EID26_POSITION                    equ 0005h
B4SIDH_EID26_SIZE                        equ 0001h
B4SIDH_EID26_LENGTH                      equ 0001h
B4SIDH_EID26_MASK                        equ 0020h
B4SIDH_EID27_POSN                        equ 0006h
B4SIDH_EID27_POSITION                    equ 0006h
B4SIDH_EID27_SIZE                        equ 0001h
B4SIDH_EID27_LENGTH                      equ 0001h
B4SIDH_EID27_MASK                        equ 0040h
B4SIDH_EID28_POSN                        equ 0007h
B4SIDH_EID28_POSITION                    equ 0007h
B4SIDH_EID28_SIZE                        equ 0001h
B4SIDH_EID28_LENGTH                      equ 0001h
B4SIDH_EID28_MASK                        equ 0080h
B4SIDH_SID_POSN                          equ 0000h
B4SIDH_SID_POSITION                      equ 0000h
B4SIDH_SID_SIZE                          equ 0008h
B4SIDH_SID_LENGTH                        equ 0008h
B4SIDH_SID_MASK                          equ 00FFh

