GopalSaraf/Practicals/PSDL/include/proc/pic18lf25k83.inc
// Register: B4SIDL
#define B4SIDL B4SIDL
B4SIDL                                   equ 03782h
// bitfield definitions
B4SIDL_EID16_POSN                        equ 0000h
B4SIDL_EID16_POSITION                    equ 0000h
B4SIDL_EID16_SIZE                        equ 0001h
B4SIDL_EID16_LENGTH                      equ 0001h
B4SIDL_EID16_MASK                        equ 0001h
B4SIDL_EID17_POSN                        equ 0001h
B4SIDL_EID17_POSITION                    equ 0001h
B4SIDL_EID17_SIZE                        equ 0001h
B4SIDL_EID17_LENGTH                      equ 0001h
B4SIDL_EID17_MASK                        equ 0002h
B4SIDL_EXIDE_POSN                        equ 0003h
B4SIDL_EXIDE_POSITION                    equ 0003h
B4SIDL_EXIDE_SIZE                        equ 0001h
B4SIDL_EXIDE_LENGTH                      equ 0001h
B4SIDL_EXIDE_MASK                        equ 0008h
B4SIDL_SRR_POSN                          equ 0004h
B4SIDL_SRR_POSITION                      equ 0004h
B4SIDL_SRR_SIZE                          equ 0001h
B4SIDL_SRR_LENGTH                        equ 0001h
B4SIDL_SRR_MASK                          equ 0010h
B4SIDL_SID0_POSN                         equ 0005h
B4SIDL_SID0_POSITION                     equ 0005h
B4SIDL_SID0_SIZE                         equ 0001h
B4SIDL_SID0_LENGTH                       equ 0001h
B4SIDL_SID0_MASK                         equ 0020h
B4SIDL_SID1_POSN                         equ 0006h
B4SIDL_SID1_POSITION                     equ 0006h
B4SIDL_SID1_SIZE                         equ 0001h
B4SIDL_SID1_LENGTH                       equ 0001h
B4SIDL_SID1_MASK                         equ 0040h
B4SIDL_SID2_POSN                         equ 0007h
B4SIDL_SID2_POSITION                     equ 0007h
B4SIDL_SID2_SIZE                         equ 0001h
B4SIDL_SID2_LENGTH                       equ 0001h
B4SIDL_SID2_MASK                         equ 0080h
B4SIDL_EID18_POSN                        equ 0005h
B4SIDL_EID18_POSITION                    equ 0005h
B4SIDL_EID18_SIZE                        equ 0001h
B4SIDL_EID18_LENGTH                      equ 0001h
B4SIDL_EID18_MASK                        equ 0020h
B4SIDL_EID19_POSN                        equ 0006h
B4SIDL_EID19_POSITION                    equ 0006h
B4SIDL_EID19_SIZE                        equ 0001h
B4SIDL_EID19_LENGTH                      equ 0001h
B4SIDL_EID19_MASK                        equ 0040h
B4SIDL_EID20_POSN                        equ 0007h
B4SIDL_EID20_POSITION                    equ 0007h
B4SIDL_EID20_SIZE                        equ 0001h
B4SIDL_EID20_LENGTH                      equ 0001h
B4SIDL_EID20_MASK                        equ 0080h
B4SIDL_EID_POSN                          equ 0000h
B4SIDL_EID_POSITION                      equ 0000h
B4SIDL_EID_SIZE                          equ 0002h
B4SIDL_EID_LENGTH                        equ 0002h
B4SIDL_EID_MASK                          equ 0003h
B4SIDL_SID_POSN                          equ 0005h
B4SIDL_SID_POSITION                      equ 0005h
B4SIDL_SID_SIZE                          equ 0003h
B4SIDL_SID_LENGTH                        equ 0003h
B4SIDL_SID_MASK                          equ 00E0h

// Register: B4EIDH
#define B4EIDH B4EIDH
B4EIDH                                   equ 03783h
// bitfield definitions
B4EIDH_EID8_POSN                         equ 0000h
B4EIDH_EID8_POSITION                     equ 0000h
B4EIDH_EID8_SIZE                         equ 0001h
B4EIDH_EID8_LENGTH                       equ 0001h
B4EIDH_EID8_MASK                         equ 0001h
B4EIDH_EID9_POSN                         equ 0001h
B4EIDH_EID9_POSITION                     equ 0001h
B4EIDH_EID9_SIZE                         equ 0001h
B4EIDH_EID9_LENGTH                       equ 0001h
B4EIDH_EID9_MASK                         equ 0002h
B4EIDH_EID10_POSN                        equ 0002h
B4EIDH_EID10_POSITION                    equ 0002h
B4EIDH_EID10_SIZE                        equ 0001h
B4EIDH_EID10_LENGTH                      equ 0001h
B4EIDH_EID10_MASK                        equ 0004h
B4EIDH_EID11_POSN                        equ 0003h
B4EIDH_EID11_POSITION                    equ 0003h
B4EIDH_EID11_SIZE                        equ 0001h
B4EIDH_EID11_LENGTH                      equ 0001h
B4EIDH_EID11_MASK                        equ 0008h
B4EIDH_EID12_POSN                        equ 0004h
B4EIDH_EID12_POSITION                    equ 0004h
B4EIDH_EID12_SIZE                        equ 0001h
B4EIDH_EID12_LENGTH                      equ 0001h
B4EIDH_EID12_MASK                        equ 0010h
B4EIDH_EID13_POSN                        equ 0005h
B4EIDH_EID13_POSITION                    equ 0005h
B4EIDH_EID13_SIZE                        equ 0001h
B4EIDH_EID13_LENGTH                      equ 0001h
B4EIDH_EID13_MASK                        equ 0020h
B4EIDH_EID14_POSN                        equ 0006h
B4EIDH_EID14_POSITION                    equ 0006h
B4EIDH_EID14_SIZE                        equ 0001h
B4EIDH_EID14_LENGTH                      equ 0001h
B4EIDH_EID14_MASK                        equ 0040h
B4EIDH_EID15_POSN                        equ 0007h
B4EIDH_EID15_POSITION                    equ 0007h
B4EIDH_EID15_SIZE                        equ 0001h
B4EIDH_EID15_LENGTH                      equ 0001h
B4EIDH_EID15_MASK                        equ 0080h
B4EIDH_EID_POSN                          equ 0000h
B4EIDH_EID_POSITION                      equ 0000h
B4EIDH_EID_SIZE                          equ 0008h
B4EIDH_EID_LENGTH                        equ 0008h
B4EIDH_EID_MASK                          equ 00FFh

// Register: B4EIDL
#define B4EIDL B4EIDL
B4EIDL                                   equ 03784h
// bitfield definitions
B4EIDL_EID0_POSN                         equ 0000h
B4EIDL_EID0_POSITION                     equ 0000h
B4EIDL_EID0_SIZE                         equ 0001h
B4EIDL_EID0_LENGTH                       equ 0001h
B4EIDL_EID0_MASK                         equ 0001h
B4EIDL_EID1_POSN                         equ 0001h
B4EIDL_EID1_POSITION                     equ 0001h
B4EIDL_EID1_SIZE                         equ 0001h
B4EIDL_EID1_LENGTH                       equ 0001h
B4EIDL_EID1_MASK                         equ 0002h
B4EIDL_EID2_POSN                         equ 0002h
B4EIDL_EID2_POSITION                     equ 0002h
B4EIDL_EID2_SIZE                         equ 0001h
B4EIDL_EID2_LENGTH                       equ 0001h
B4EIDL_EID2_MASK                         equ 0004h
B4EIDL_EID3_POSN                         equ 0003h
B4EIDL_EID3_POSITION                     equ 0003h
B4EIDL_EID3_SIZE                         equ 0001h
B4EIDL_EID3_LENGTH                       equ 0001h
B4EIDL_EID3_MASK                         equ 0008h
B4EIDL_EID4_POSN                         equ 0004h
B4EIDL_EID4_POSITION                     equ 0004h
B4EIDL_EID4_SIZE                         equ 0001h
B4EIDL_EID4_LENGTH                       equ 0001h
B4EIDL_EID4_MASK                         equ 0010h
B4EIDL_EID5_POSN                         equ 0005h
B4EIDL_EID5_POSITION                     equ 0005h
B4EIDL_EID5_SIZE                         equ 0001h
B4EIDL_EID5_LENGTH                       equ 0001h
B4EIDL_EID5_MASK                         equ 0020h
B4EIDL_EID6_POSN                         equ 0006h
B4EIDL_EID6_POSITION                     equ 0006h
B4EIDL_EID6_SIZE                         equ 0001h
B4EIDL_EID6_LENGTH                       equ 0001h
B4EIDL_EID6_MASK                         equ 0040h
B4EIDL_EID7_POSN                         equ 0007h
B4EIDL_EID7_POSITION                     equ 0007h
B4EIDL_EID7_SIZE                         equ 0001h
B4EIDL_EID7_LENGTH                       equ 0001h
B4EIDL_EID7_MASK                         equ 0080h
B4EIDL_EID_POSN                          equ 0000h
B4EIDL_EID_POSITION                      equ 0000h
B4EIDL_EID_SIZE                          equ 0008h
B4EIDL_EID_LENGTH                        equ 0008h
B4EIDL_EID_MASK                          equ 00FFh

// Register: B4DLC
#define B4DLC B4DLC
B4DLC                                    equ 03785h
// bitfield definitions
B4DLC_DLC0_POSN                          equ 0000h
B4DLC_DLC0_POSITION                      equ 0000h
B4DLC_DLC0_SIZE                          equ 0001h
B4DLC_DLC0_LENGTH                        equ 0001h
B4DLC_DLC0_MASK                          equ 0001h
B4DLC_DLC1_POSN                          equ 0001h
B4DLC_DLC1_POSITION                      equ 0001h
B4DLC_DLC1_SIZE                          equ 0001h
B4DLC_DLC1_LENGTH                        equ 0001h
B4DLC_DLC1_MASK                          equ 0002h
B4DLC_DLC2_POSN                          equ 0002h
B4DLC_DLC2_POSITION                      equ 0002h
B4DLC_DLC2_SIZE                          equ 0001h
B4DLC_DLC2_LENGTH                        equ 0001h
B4DLC_DLC2_MASK                          equ 0004h
B4DLC_DLC3_POSN                          equ 0003h
B4DLC_DLC3_POSITION                      equ 0003h
B4DLC_DLC3_SIZE                          equ 0001h
B4DLC_DLC3_LENGTH                        equ 0001h
B4DLC_DLC3_MASK                          equ 0008h
B4DLC_RB0_POSN                           equ 0004h
B4DLC_RB0_POSITION                       equ 0004h
B4DLC_RB0_SIZE                           equ 0001h
B4DLC_RB0_LENGTH                         equ 0001h
B4DLC_RB0_MASK                           equ 0010h
B4DLC_RB1_POSN                           equ 0005h
B4DLC_RB1_POSITION                       equ 0005h
B4DLC_RB1_SIZE                           equ 0001h
B4DLC_RB1_LENGTH                         equ 0001h
B4DLC_RB1_MASK                           equ 0020h
B4DLC_RXRTR_TXRTR_POSN                   equ 0006h
B4DLC_RXRTR_TXRTR_POSITION               equ 0006h
B4DLC_RXRTR_TXRTR_SIZE                   equ 0001h
B4DLC_RXRTR_TXRTR_LENGTH                 equ 0001h
B4DLC_RXRTR_TXRTR_MASK                   equ 0040h
B4DLC_DLC_POSN                           equ 0000h
B4DLC_DLC_POSITION                       equ 0000h
B4DLC_DLC_SIZE                           equ 0004h
B4DLC_DLC_LENGTH                         equ 0004h
B4DLC_DLC_MASK                           equ 000Fh
B4DLC_RB_POSN                            equ 0004h
B4DLC_RB_POSITION                        equ 0004h
B4DLC_RB_SIZE                            equ 0002h
B4DLC_RB_LENGTH                          equ 0002h
B4DLC_RB_MASK                            equ 0030h
B4DLC_RXRTR_POSN                         equ 0006h
B4DLC_RXRTR_POSITION                     equ 0006h
B4DLC_RXRTR_SIZE                         equ 0001h
B4DLC_RXRTR_LENGTH                       equ 0001h
B4DLC_RXRTR_MASK                         equ 0040h
B4DLC_TXRTR_POSN                         equ 0006h
B4DLC_TXRTR_POSITION                     equ 0006h
B4DLC_TXRTR_SIZE                         equ 0001h
B4DLC_TXRTR_LENGTH                       equ 0001h
B4DLC_TXRTR_MASK                         equ 0040h

// Register: B4D0
#define B4D0 B4D0
B4D0                                     equ 03786h
// bitfield definitions
B4D0_B4D0_POSN                           equ 0000h
B4D0_B4D0_POSITION                       equ 0000h
B4D0_B4D0_SIZE                           equ 0008h
B4D0_B4D0_LENGTH                         equ 0008h
B4D0_B4D0_MASK                           equ 00FFh
B4D0_B4D00_POSN                          equ 0000h
B4D0_B4D00_POSITION                      equ 0000h
B4D0_B4D00_SIZE                          equ 0001h
B4D0_B4D00_LENGTH                        equ 0001h
B4D0_B4D00_MASK                          equ 0001h
B4D0_B4D01_POSN                          equ 0001h
B4D0_B4D01_POSITION                      equ 0001h
B4D0_B4D01_SIZE                          equ 0001h
B4D0_B4D01_LENGTH                        equ 0001h
B4D0_B4D01_MASK                          equ 0002h
B4D0_B4D02_POSN                          equ 0002h
B4D0_B4D02_POSITION                      equ 0002h
B4D0_B4D02_SIZE                          equ 0001h
B4D0_B4D02_LENGTH                        equ 0001h
B4D0_B4D02_MASK                          equ 0004h
B4D0_B4D03_POSN                          equ 0003h
B4D0_B4D03_POSITION                      equ 0003h
B4D0_B4D03_SIZE                          equ 0001h
B4D0_B4D03_LENGTH                        equ 0001h
B4D0_B4D03_MASK                          equ 0008h
B4D0_B4D04_POSN                          equ 0004h
B4D0_B4D04_POSITION                      equ 0004h
B4D0_B4D04_SIZE                          equ 0001h
B4D0_B4D04_LENGTH                        equ 0001h
B4D0_B4D04_MASK                          equ 0010h
B4D0_B4D05_POSN                          equ 0005h
B4D0_B4D05_POSITION                      equ 0005h
B4D0_B4D05_SIZE                          equ 0001h
B4D0_B4D05_LENGTH                        equ 0001h
B4D0_B4D05_MASK                          equ 0020h
B4D0_B4D06_POSN                          equ 0006h
B4D0_B4D06_POSITION                      equ 0006h
B4D0_B4D06_SIZE                          equ 0001h
B4D0_B4D06_LENGTH                        equ 0001h
B4D0_B4D06_MASK                          equ 0040h
B4D0_B4D07_POSN                          equ 0007h
B4D0_B4D07_POSITION                      equ 0007h
B4D0_B4D07_SIZE                          equ 0001h
B4D0_B4D07_LENGTH                        equ 0001h
B4D0_B4D07_MASK                          equ 0080h

// Register: B4D1
#define B4D1 B4D1
B4D1                                     equ 03787h
// bitfield definitions
B4D1_B4D1_POSN                           equ 0000h
B4D1_B4D1_POSITION                       equ 0000h
B4D1_B4D1_SIZE                           equ 0008h
B4D1_B4D1_LENGTH                         equ 0008h
B4D1_B4D1_MASK                           equ 00FFh
B4D1_B4D10_POSN                          equ 0000h
B4D1_B4D10_POSITION                      equ 0000h
B4D1_B4D10_SIZE                          equ 0001h
B4D1_B4D10_LENGTH                        equ 0001h
B4D1_B4D10_MASK                          equ 0001h
B4D1_B4D11_POSN                          equ 0001h
B4D1_B4D11_POSITION                      equ 0001h
B4D1_B4D11_SIZE                          equ 0001h
B4D1_B4D11_LENGTH                        equ 0001h
B4D1_B4D11_MASK                          equ 0002h
B4D1_B4D12_POSN                          equ 0002h
B4D1_B4D12_POSITION                      equ 0002h
B4D1_B4D12_SIZE                          equ 0001h
B4D1_B4D12_LENGTH                        equ 0001h
B4D1_B4D12_MASK                          equ 0004h
B4D1_B4D13_POSN                          equ 0003h
B4D1_B4D13_POSITION                      equ 0003h
B4D1_B4D13_SIZE                          equ 0001h
B4D1_B4D13_LENGTH                        equ 0001h
B4D1_B4D13_MASK                          equ 0008h
B4D1_B4D14_POSN                          equ 0004h
B4D1_B4D14_POSITION                      equ 0004h
B4D1_B4D14_SIZE                          equ 0001h
B4D1_B4D14_LENGTH                        equ 0001h
B4D1_B4D14_MASK                          equ 0010h
B4D1_B4D15_POSN                          equ 0005h
B4D1_B4D15_POSITION                      equ 0005h
B4D1_B4D15_SIZE                          equ 0001h
B4D1_B4D15_LENGTH                        equ 0001h
B4D1_B4D15_MASK                          equ 0020h
B4D1_B4D16_POSN                          equ 0006h
B4D1_B4D16_POSITION                      equ 0006h
B4D1_B4D16_SIZE                          equ 0001h
B4D1_B4D16_LENGTH                        equ 0001h
B4D1_B4D16_MASK                          equ 0040h
B4D1_B4D17_POSN                          equ 0007h
B4D1_B4D17_POSITION                      equ 0007h
B4D1_B4D17_SIZE                          equ 0001h
B4D1_B4D17_LENGTH                        equ 0001h
B4D1_B4D17_MASK                          equ 0080h

// Register: B4D2
#define B4D2 B4D2
B4D2                                     equ 03788h
// bitfield definitions
B4D2_B4D2_POSN                           equ 0000h
B4D2_B4D2_POSITION                       equ 0000h
B4D2_B4D2_SIZE                           equ 0008h
B4D2_B4D2_LENGTH                         equ 0008h
B4D2_B4D2_MASK                           equ 00FFh
B4D2_B4D20_POSN                          equ 0000h
B4D2_B4D20_POSITION                      equ 0000h
B4D2_B4D20_SIZE                          equ 0001h
B4D2_B4D20_LENGTH                        equ 0001h
B4D2_B4D20_MASK                          equ 0001h
B4D2_B4D21_POSN                          equ 0001h
B4D2_B4D21_POSITION                      equ 0001h
B4D2_B4D21_SIZE                          equ 0001h
B4D2_B4D21_LENGTH                        equ 0001h
B4D2_B4D21_MASK                          equ 0002h
B4D2_B4D22_POSN                          equ 0002h
B4D2_B4D22_POSITION                      equ 0002h
B4D2_B4D22_SIZE                          equ 0001h
B4D2_B4D22_LENGTH                        equ 0001h
B4D2_B4D22_MASK                          equ 0004h
B4D2_B4D23_POSN                          equ 0003h
B4D2_B4D23_POSITION                      equ 0003h
B4D2_B4D23_SIZE                          equ 0001h
B4D2_B4D23_LENGTH                        equ 0001h
B4D2_B4D23_MASK                          equ 0008h
B4D2_B4D24_POSN                          equ 0004h
B4D2_B4D24_POSITION                      equ 0004h
B4D2_B4D24_SIZE                          equ 0001h
B4D2_B4D24_LENGTH                        equ 0001h
B4D2_B4D24_MASK                          equ 0010h
B4D2_B4D25_POSN                          equ 0005h
B4D2_B4D25_POSITION                      equ 0005h
B4D2_B4D25_SIZE                          equ 0001h
B4D2_B4D25_LENGTH                        equ 0001h
B4D2_B4D25_MASK                          equ 0020h
B4D2_B4D26_POSN                          equ 0006h
B4D2_B4D26_POSITION                      equ 0006h
B4D2_B4D26_SIZE                          equ 0001h
B4D2_B4D26_LENGTH                        equ 0001h
B4D2_B4D26_MASK                          equ 0040h
B4D2_B4D27_POSN                          equ 0007h
B4D2_B4D27_POSITION                      equ 0007h
B4D2_B4D27_SIZE                          equ 0001h
B4D2_B4D27_LENGTH                        equ 0001h
B4D2_B4D27_MASK                          equ 0080h

// Register: B4D3
#define B4D3 B4D3
B4D3                                     equ 03789h
// bitfield definitions
B4D3_B4D3_POSN                           equ 0000h
B4D3_B4D3_POSITION                       equ 0000h
B4D3_B4D3_SIZE                           equ 0008h
B4D3_B4D3_LENGTH                         equ 0008h
B4D3_B4D3_MASK                           equ 00FFh
B4D3_B4D30_POSN                          equ 0000h
B4D3_B4D30_POSITION                      equ 0000h
B4D3_B4D30_SIZE                          equ 0001h
B4D3_B4D30_LENGTH                        equ 0001h
B4D3_B4D30_MASK                          equ 0001h
B4D3_B4D31_POSN                          equ 0001h
B4D3_B4D31_POSITION                      equ 0001h
B4D3_B4D31_SIZE                          equ 0001h
B4D3_B4D31_LENGTH                        equ 0001h
B4D3_B4D31_MASK                          equ 0002h
B4D3_B4D32_POSN                          equ 0002h
B4D3_B4D32_POSITION                      equ 0002h
B4D3_B4D32_SIZE                          equ 0001h
B4D3_B4D32_LENGTH                        equ 0001h
B4D3_B4D32_MASK                          equ 0004h
B4D3_B4D33_POSN                          equ 0003h
B4D3_B4D33_POSITION                      equ 0003h
B4D3_B4D33_SIZE                          equ 0001h
B4D3_B4D33_LENGTH                        equ 0001h
B4D3_B4D33_MASK                          equ 0008h
B4D3_B4D34_POSN                          equ 0004h
B4D3_B4D34_POSITION                      equ 0004h
B4D3_B4D34_SIZE                          equ 0001h
B4D3_B4D34_LENGTH                        equ 0001h
B4D3_B4D34_MASK                          equ 0010h
B4D3_B4D35_POSN                          equ 0005h
B4D3_B4D35_POSITION                      equ 0005h
B4D3_B4D35_SIZE                          equ 0001h
B4D3_B4D35_LENGTH                        equ 0001h
B4D3_B4D35_MASK                          equ 0020h
B4D3_B4D36_POSN                          equ 0006h
B4D3_B4D36_POSITION                      equ 0006h
B4D3_B4D36_SIZE                          equ 0001h
B4D3_B4D36_LENGTH                        equ 0001h
B4D3_B4D36_MASK                          equ 0040h
B4D3_B4D37_POSN                          equ 0007h
B4D3_B4D37_POSITION                      equ 0007h
B4D3_B4D37_SIZE                          equ 0001h
B4D3_B4D37_LENGTH                        equ 0001h
B4D3_B4D37_MASK                          equ 0080h

// Register: B4D4
#define B4D4 B4D4
B4D4                                     equ 0378Ah
// bitfield definitions
B4D4_B4D4_POSN                           equ 0000h
B4D4_B4D4_POSITION                       equ 0000h
B4D4_B4D4_SIZE                           equ 0008h
B4D4_B4D4_LENGTH                         equ 0008h
B4D4_B4D4_MASK                           equ 00FFh
B4D4_B4D40_POSN                          equ 0000h
B4D4_B4D40_POSITION                      equ 0000h
B4D4_B4D40_SIZE                          equ 0001h
B4D4_B4D40_LENGTH                        equ 0001h
B4D4_B4D40_MASK                          equ 0001h
B4D4_B4D41_POSN                          equ 0001h
B4D4_B4D41_POSITION                      equ 0001h
B4D4_B4D41_SIZE                          equ 0001h
B4D4_B4D41_LENGTH                        equ 0001h
B4D4_B4D41_MASK                          equ 0002h
B4D4_B4D42_POSN                          equ 0002h
B4D4_B4D42_POSITION                      equ 0002h
B4D4_B4D42_SIZE                          equ 0001h
B4D4_B4D42_LENGTH                        equ 0001h
B4D4_B4D42_MASK                          equ 0004h
B4D4_B4D43_POSN                          equ 0003h
B4D4_B4D43_POSITION                      equ 0003h
B4D4_B4D43_SIZE                          equ 0001h
B4D4_B4D43_LENGTH                        equ 0001h
B4D4_B4D43_MASK                          equ 0008h
B4D4_B4D44_POSN                          equ 0004h
B4D4_B4D44_POSITION                      equ 0004h
B4D4_B4D44_SIZE                          equ 0001h
B4D4_B4D44_LENGTH                        equ 0001h
B4D4_B4D44_MASK                          equ 0010h
B4D4_B4D45_POSN                          equ 0005h
B4D4_B4D45_POSITION                      equ 0005h
B4D4_B4D45_SIZE                          equ 0001h
B4D4_B4D45_LENGTH                        equ 0001h
B4D4_B4D45_MASK                          equ 0020h
B4D4_B4D46_POSN                          equ 0006h
B4D4_B4D46_POSITION                      equ 0006h
B4D4_B4D46_SIZE                          equ 0001h
B4D4_B4D46_LENGTH                        equ 0001h
B4D4_B4D46_MASK                          equ 0040h
B4D4_B4D47_POSN                          equ 0007h
B4D4_B4D47_POSITION                      equ 0007h
B4D4_B4D47_SIZE                          equ 0001h
B4D4_B4D47_LENGTH                        equ 0001h
B4D4_B4D47_MASK                          equ 0080h

