GopalSaraf/Practicals/PSDL/include/proc/pic18lf25k83.inc
// Register: RXM1EIDH
#define RXM1EIDH RXM1EIDH
RXM1EIDH                                 equ 037BEh
// bitfield definitions
RXM1EIDH_EID8_POSN                       equ 0000h
RXM1EIDH_EID8_POSITION                   equ 0000h
RXM1EIDH_EID8_SIZE                       equ 0001h
RXM1EIDH_EID8_LENGTH                     equ 0001h
RXM1EIDH_EID8_MASK                       equ 0001h
RXM1EIDH_EID9_POSN                       equ 0001h
RXM1EIDH_EID9_POSITION                   equ 0001h
RXM1EIDH_EID9_SIZE                       equ 0001h
RXM1EIDH_EID9_LENGTH                     equ 0001h
RXM1EIDH_EID9_MASK                       equ 0002h
RXM1EIDH_EID10_POSN                      equ 0002h
RXM1EIDH_EID10_POSITION                  equ 0002h
RXM1EIDH_EID10_SIZE                      equ 0001h
RXM1EIDH_EID10_LENGTH                    equ 0001h
RXM1EIDH_EID10_MASK                      equ 0004h
RXM1EIDH_EID11_POSN                      equ 0003h
RXM1EIDH_EID11_POSITION                  equ 0003h
RXM1EIDH_EID11_SIZE                      equ 0001h
RXM1EIDH_EID11_LENGTH                    equ 0001h
RXM1EIDH_EID11_MASK                      equ 0008h
RXM1EIDH_EID12_POSN                      equ 0004h
RXM1EIDH_EID12_POSITION                  equ 0004h
RXM1EIDH_EID12_SIZE                      equ 0001h
RXM1EIDH_EID12_LENGTH                    equ 0001h
RXM1EIDH_EID12_MASK                      equ 0010h
RXM1EIDH_EID13_POSN                      equ 0005h
RXM1EIDH_EID13_POSITION                  equ 0005h
RXM1EIDH_EID13_SIZE                      equ 0001h
RXM1EIDH_EID13_LENGTH                    equ 0001h
RXM1EIDH_EID13_MASK                      equ 0020h
RXM1EIDH_EID14_POSN                      equ 0006h
RXM1EIDH_EID14_POSITION                  equ 0006h
RXM1EIDH_EID14_SIZE                      equ 0001h
RXM1EIDH_EID14_LENGTH                    equ 0001h
RXM1EIDH_EID14_MASK                      equ 0040h
RXM1EIDH_EID15_POSN                      equ 0007h
RXM1EIDH_EID15_POSITION                  equ 0007h
RXM1EIDH_EID15_SIZE                      equ 0001h
RXM1EIDH_EID15_LENGTH                    equ 0001h
RXM1EIDH_EID15_MASK                      equ 0080h
RXM1EIDH_EID_POSN                        equ 0000h
RXM1EIDH_EID_POSITION                    equ 0000h
RXM1EIDH_EID_SIZE                        equ 0008h
RXM1EIDH_EID_LENGTH                      equ 0008h
RXM1EIDH_EID_MASK                        equ 00FFh

// Register: RXM1EIDL
#define RXM1EIDL RXM1EIDL
RXM1EIDL                                 equ 037BFh
// bitfield definitions
RXM1EIDL_EID0_POSN                       equ 0000h
RXM1EIDL_EID0_POSITION                   equ 0000h
RXM1EIDL_EID0_SIZE                       equ 0001h
RXM1EIDL_EID0_LENGTH                     equ 0001h
RXM1EIDL_EID0_MASK                       equ 0001h
RXM1EIDL_EID1_POSN                       equ 0001h
RXM1EIDL_EID1_POSITION                   equ 0001h
RXM1EIDL_EID1_SIZE                       equ 0001h
RXM1EIDL_EID1_LENGTH                     equ 0001h
RXM1EIDL_EID1_MASK                       equ 0002h
RXM1EIDL_EID2_POSN                       equ 0002h
RXM1EIDL_EID2_POSITION                   equ 0002h
RXM1EIDL_EID2_SIZE                       equ 0001h
RXM1EIDL_EID2_LENGTH                     equ 0001h
RXM1EIDL_EID2_MASK                       equ 0004h
RXM1EIDL_EID3_POSN                       equ 0003h
RXM1EIDL_EID3_POSITION                   equ 0003h
RXM1EIDL_EID3_SIZE                       equ 0001h
RXM1EIDL_EID3_LENGTH                     equ 0001h
RXM1EIDL_EID3_MASK                       equ 0008h
RXM1EIDL_EID4_POSN                       equ 0004h
RXM1EIDL_EID4_POSITION                   equ 0004h
RXM1EIDL_EID4_SIZE                       equ 0001h
RXM1EIDL_EID4_LENGTH                     equ 0001h
RXM1EIDL_EID4_MASK                       equ 0010h
RXM1EIDL_EID5_POSN                       equ 0005h
RXM1EIDL_EID5_POSITION                   equ 0005h
RXM1EIDL_EID5_SIZE                       equ 0001h
RXM1EIDL_EID5_LENGTH                     equ 0001h
RXM1EIDL_EID5_MASK                       equ 0020h
RXM1EIDL_EID6_POSN                       equ 0006h
RXM1EIDL_EID6_POSITION                   equ 0006h
RXM1EIDL_EID6_SIZE                       equ 0001h
RXM1EIDL_EID6_LENGTH                     equ 0001h
RXM1EIDL_EID6_MASK                       equ 0040h
RXM1EIDL_EID7_POSN                       equ 0007h
RXM1EIDL_EID7_POSITION                   equ 0007h
RXM1EIDL_EID7_SIZE                       equ 0001h
RXM1EIDL_EID7_LENGTH                     equ 0001h
RXM1EIDL_EID7_MASK                       equ 0080h
RXM1EIDL_EID_POSN                        equ 0000h
RXM1EIDL_EID_POSITION                    equ 0000h
RXM1EIDL_EID_SIZE                        equ 0008h
RXM1EIDL_EID_LENGTH                      equ 0008h
RXM1EIDL_EID_MASK                        equ 00FFh

// Register: TXB2CON
#define TXB2CON TXB2CON
TXB2CON                                  equ 037C0h
// bitfield definitions
TXB2CON_TXPRI_POSN                       equ 0000h
TXB2CON_TXPRI_POSITION                   equ 0000h
TXB2CON_TXPRI_SIZE                       equ 0002h
TXB2CON_TXPRI_LENGTH                     equ 0002h
TXB2CON_TXPRI_MASK                       equ 0003h
TXB2CON_TXREQ_POSN                       equ 0003h
TXB2CON_TXREQ_POSITION                   equ 0003h
TXB2CON_TXREQ_SIZE                       equ 0001h
TXB2CON_TXREQ_LENGTH                     equ 0001h
TXB2CON_TXREQ_MASK                       equ 0008h
TXB2CON_TXERR_POSN                       equ 0004h
TXB2CON_TXERR_POSITION                   equ 0004h
TXB2CON_TXERR_SIZE                       equ 0001h
TXB2CON_TXERR_LENGTH                     equ 0001h
TXB2CON_TXERR_MASK                       equ 0010h
TXB2CON_TXLARB_POSN                      equ 0005h
TXB2CON_TXLARB_POSITION                  equ 0005h
TXB2CON_TXLARB_SIZE                      equ 0001h
TXB2CON_TXLARB_LENGTH                    equ 0001h
TXB2CON_TXLARB_MASK                      equ 0020h
TXB2CON_TXABT_POSN                       equ 0006h
TXB2CON_TXABT_POSITION                   equ 0006h
TXB2CON_TXABT_SIZE                       equ 0001h
TXB2CON_TXABT_LENGTH                     equ 0001h
TXB2CON_TXABT_MASK                       equ 0040h
TXB2CON_TXBIF_POSN                       equ 0007h
TXB2CON_TXBIF_POSITION                   equ 0007h
TXB2CON_TXBIF_SIZE                       equ 0001h
TXB2CON_TXBIF_LENGTH                     equ 0001h
TXB2CON_TXBIF_MASK                       equ 0080h
TXB2CON_TXPRI0_POSN                      equ 0000h
TXB2CON_TXPRI0_POSITION                  equ 0000h
TXB2CON_TXPRI0_SIZE                      equ 0001h
TXB2CON_TXPRI0_LENGTH                    equ 0001h
TXB2CON_TXPRI0_MASK                      equ 0001h
TXB2CON_TXPRI1_POSN                      equ 0001h
TXB2CON_TXPRI1_POSITION                  equ 0001h
TXB2CON_TXPRI1_SIZE                      equ 0001h
TXB2CON_TXPRI1_LENGTH                    equ 0001h
TXB2CON_TXPRI1_MASK                      equ 0002h

// Register: TXB2SIDH
#define TXB2SIDH TXB2SIDH
TXB2SIDH                                 equ 037C1h
// bitfield definitions
TXB2SIDH_SID3_POSN                       equ 0000h
TXB2SIDH_SID3_POSITION                   equ 0000h
TXB2SIDH_SID3_SIZE                       equ 0001h
TXB2SIDH_SID3_LENGTH                     equ 0001h
TXB2SIDH_SID3_MASK                       equ 0001h
TXB2SIDH_SID4_POSN                       equ 0001h
TXB2SIDH_SID4_POSITION                   equ 0001h
TXB2SIDH_SID4_SIZE                       equ 0001h
TXB2SIDH_SID4_LENGTH                     equ 0001h
TXB2SIDH_SID4_MASK                       equ 0002h
TXB2SIDH_SID5_POSN                       equ 0002h
TXB2SIDH_SID5_POSITION                   equ 0002h
TXB2SIDH_SID5_SIZE                       equ 0001h
TXB2SIDH_SID5_LENGTH                     equ 0001h
TXB2SIDH_SID5_MASK                       equ 0004h
TXB2SIDH_SID6_POSN                       equ 0003h
TXB2SIDH_SID6_POSITION                   equ 0003h
TXB2SIDH_SID6_SIZE                       equ 0001h
TXB2SIDH_SID6_LENGTH                     equ 0001h
TXB2SIDH_SID6_MASK                       equ 0008h
TXB2SIDH_SID7_POSN                       equ 0004h
TXB2SIDH_SID7_POSITION                   equ 0004h
TXB2SIDH_SID7_SIZE                       equ 0001h
TXB2SIDH_SID7_LENGTH                     equ 0001h
TXB2SIDH_SID7_MASK                       equ 0010h
TXB2SIDH_SID8_POSN                       equ 0005h
TXB2SIDH_SID8_POSITION                   equ 0005h
TXB2SIDH_SID8_SIZE                       equ 0001h
TXB2SIDH_SID8_LENGTH                     equ 0001h
TXB2SIDH_SID8_MASK                       equ 0020h
TXB2SIDH_SID9_POSN                       equ 0006h
TXB2SIDH_SID9_POSITION                   equ 0006h
TXB2SIDH_SID9_SIZE                       equ 0001h
TXB2SIDH_SID9_LENGTH                     equ 0001h
TXB2SIDH_SID9_MASK                       equ 0040h
TXB2SIDH_SID10_POSN                      equ 0007h
TXB2SIDH_SID10_POSITION                  equ 0007h
TXB2SIDH_SID10_SIZE                      equ 0001h
TXB2SIDH_SID10_LENGTH                    equ 0001h
TXB2SIDH_SID10_MASK                      equ 0080h
TXB2SIDH_EID21_POSN                      equ 0000h
TXB2SIDH_EID21_POSITION                  equ 0000h
TXB2SIDH_EID21_SIZE                      equ 0001h
TXB2SIDH_EID21_LENGTH                    equ 0001h
TXB2SIDH_EID21_MASK                      equ 0001h
TXB2SIDH_EID22_POSN                      equ 0001h
TXB2SIDH_EID22_POSITION                  equ 0001h
TXB2SIDH_EID22_SIZE                      equ 0001h
TXB2SIDH_EID22_LENGTH                    equ 0001h
TXB2SIDH_EID22_MASK                      equ 0002h
TXB2SIDH_EID23_POSN                      equ 0002h
TXB2SIDH_EID23_POSITION                  equ 0002h
TXB2SIDH_EID23_SIZE                      equ 0001h
TXB2SIDH_EID23_LENGTH                    equ 0001h
TXB2SIDH_EID23_MASK                      equ 0004h
TXB2SIDH_EID24_POSN                      equ 0003h
TXB2SIDH_EID24_POSITION                  equ 0003h
TXB2SIDH_EID24_SIZE                      equ 0001h
TXB2SIDH_EID24_LENGTH                    equ 0001h
TXB2SIDH_EID24_MASK                      equ 0008h
TXB2SIDH_EID25_POSN                      equ 0004h
TXB2SIDH_EID25_POSITION                  equ 0004h
TXB2SIDH_EID25_SIZE                      equ 0001h
TXB2SIDH_EID25_LENGTH                    equ 0001h
TXB2SIDH_EID25_MASK                      equ 0010h
TXB2SIDH_EID26_POSN                      equ 0005h
TXB2SIDH_EID26_POSITION                  equ 0005h
TXB2SIDH_EID26_SIZE                      equ 0001h
TXB2SIDH_EID26_LENGTH                    equ 0001h
TXB2SIDH_EID26_MASK                      equ 0020h
TXB2SIDH_EID27_POSN                      equ 0006h
TXB2SIDH_EID27_POSITION                  equ 0006h
TXB2SIDH_EID27_SIZE                      equ 0001h
TXB2SIDH_EID27_LENGTH                    equ 0001h
TXB2SIDH_EID27_MASK                      equ 0040h
TXB2SIDH_EID28_POSN                      equ 0007h
TXB2SIDH_EID28_POSITION                  equ 0007h
TXB2SIDH_EID28_SIZE                      equ 0001h
TXB2SIDH_EID28_LENGTH                    equ 0001h
TXB2SIDH_EID28_MASK                      equ 0080h
TXB2SIDH_SID_POSN                        equ 0000h
TXB2SIDH_SID_POSITION                    equ 0000h
TXB2SIDH_SID_SIZE                        equ 0008h
TXB2SIDH_SID_LENGTH                      equ 0008h
TXB2SIDH_SID_MASK                        equ 00FFh

