GopalSaraf/Practicals/PSDL/include/proc/pic18lf25k83.inc
// Register: TXB0SIDL
#define TXB0SIDL TXB0SIDL
TXB0SIDL                                 equ 037E2h
// bitfield definitions
TXB0SIDL_EID16_POSN                      equ 0000h
TXB0SIDL_EID16_POSITION                  equ 0000h
TXB0SIDL_EID16_SIZE                      equ 0001h
TXB0SIDL_EID16_LENGTH                    equ 0001h
TXB0SIDL_EID16_MASK                      equ 0001h
TXB0SIDL_EID17_POSN                      equ 0001h
TXB0SIDL_EID17_POSITION                  equ 0001h
TXB0SIDL_EID17_SIZE                      equ 0001h
TXB0SIDL_EID17_LENGTH                    equ 0001h
TXB0SIDL_EID17_MASK                      equ 0002h
TXB0SIDL_EXIDE_POSN                      equ 0003h
TXB0SIDL_EXIDE_POSITION                  equ 0003h
TXB0SIDL_EXIDE_SIZE                      equ 0001h
TXB0SIDL_EXIDE_LENGTH                    equ 0001h
TXB0SIDL_EXIDE_MASK                      equ 0008h
TXB0SIDL_SID0_POSN                       equ 0005h
TXB0SIDL_SID0_POSITION                   equ 0005h
TXB0SIDL_SID0_SIZE                       equ 0001h
TXB0SIDL_SID0_LENGTH                     equ 0001h
TXB0SIDL_SID0_MASK                       equ 0020h
TXB0SIDL_SID1_POSN                       equ 0006h
TXB0SIDL_SID1_POSITION                   equ 0006h
TXB0SIDL_SID1_SIZE                       equ 0001h
TXB0SIDL_SID1_LENGTH                     equ 0001h
TXB0SIDL_SID1_MASK                       equ 0040h
TXB0SIDL_SID2_POSN                       equ 0007h
TXB0SIDL_SID2_POSITION                   equ 0007h
TXB0SIDL_SID2_SIZE                       equ 0001h
TXB0SIDL_SID2_LENGTH                     equ 0001h
TXB0SIDL_SID2_MASK                       equ 0080h
TXB0SIDL_EID18_POSN                      equ 0005h
TXB0SIDL_EID18_POSITION                  equ 0005h
TXB0SIDL_EID18_SIZE                      equ 0001h
TXB0SIDL_EID18_LENGTH                    equ 0001h
TXB0SIDL_EID18_MASK                      equ 0020h
TXB0SIDL_EID19_POSN                      equ 0006h
TXB0SIDL_EID19_POSITION                  equ 0006h
TXB0SIDL_EID19_SIZE                      equ 0001h
TXB0SIDL_EID19_LENGTH                    equ 0001h
TXB0SIDL_EID19_MASK                      equ 0040h
TXB0SIDL_EID20_POSN                      equ 0007h
TXB0SIDL_EID20_POSITION                  equ 0007h
TXB0SIDL_EID20_SIZE                      equ 0001h
TXB0SIDL_EID20_LENGTH                    equ 0001h
TXB0SIDL_EID20_MASK                      equ 0080h
TXB0SIDL_EID_POSN                        equ 0000h
TXB0SIDL_EID_POSITION                    equ 0000h
TXB0SIDL_EID_SIZE                        equ 0002h
TXB0SIDL_EID_LENGTH                      equ 0002h
TXB0SIDL_EID_MASK                        equ 0003h
TXB0SIDL_SID_POSN                        equ 0005h
TXB0SIDL_SID_POSITION                    equ 0005h
TXB0SIDL_SID_SIZE                        equ 0003h
TXB0SIDL_SID_LENGTH                      equ 0003h
TXB0SIDL_SID_MASK                        equ 00E0h

// Register: TXB0EIDH
#define TXB0EIDH TXB0EIDH
TXB0EIDH                                 equ 037E3h
// bitfield definitions
TXB0EIDH_EID8_POSN                       equ 0000h
TXB0EIDH_EID8_POSITION                   equ 0000h
TXB0EIDH_EID8_SIZE                       equ 0001h
TXB0EIDH_EID8_LENGTH                     equ 0001h
TXB0EIDH_EID8_MASK                       equ 0001h
TXB0EIDH_EID9_POSN                       equ 0001h
TXB0EIDH_EID9_POSITION                   equ 0001h
TXB0EIDH_EID9_SIZE                       equ 0001h
TXB0EIDH_EID9_LENGTH                     equ 0001h
TXB0EIDH_EID9_MASK                       equ 0002h
TXB0EIDH_EID10_POSN                      equ 0002h
TXB0EIDH_EID10_POSITION                  equ 0002h
TXB0EIDH_EID10_SIZE                      equ 0001h
TXB0EIDH_EID10_LENGTH                    equ 0001h
TXB0EIDH_EID10_MASK                      equ 0004h
TXB0EIDH_EID11_POSN                      equ 0003h
TXB0EIDH_EID11_POSITION                  equ 0003h
TXB0EIDH_EID11_SIZE                      equ 0001h
TXB0EIDH_EID11_LENGTH                    equ 0001h
TXB0EIDH_EID11_MASK                      equ 0008h
TXB0EIDH_EID12_POSN                      equ 0004h
TXB0EIDH_EID12_POSITION                  equ 0004h
TXB0EIDH_EID12_SIZE                      equ 0001h
TXB0EIDH_EID12_LENGTH                    equ 0001h
TXB0EIDH_EID12_MASK                      equ 0010h
TXB0EIDH_EID13_POSN                      equ 0005h
TXB0EIDH_EID13_POSITION                  equ 0005h
TXB0EIDH_EID13_SIZE                      equ 0001h
TXB0EIDH_EID13_LENGTH                    equ 0001h
TXB0EIDH_EID13_MASK                      equ 0020h
TXB0EIDH_EID14_POSN                      equ 0006h
TXB0EIDH_EID14_POSITION                  equ 0006h
TXB0EIDH_EID14_SIZE                      equ 0001h
TXB0EIDH_EID14_LENGTH                    equ 0001h
TXB0EIDH_EID14_MASK                      equ 0040h
TXB0EIDH_EID15_POSN                      equ 0007h
TXB0EIDH_EID15_POSITION                  equ 0007h
TXB0EIDH_EID15_SIZE                      equ 0001h
TXB0EIDH_EID15_LENGTH                    equ 0001h
TXB0EIDH_EID15_MASK                      equ 0080h
TXB0EIDH_EID_POSN                        equ 0000h
TXB0EIDH_EID_POSITION                    equ 0000h
TXB0EIDH_EID_SIZE                        equ 0008h
TXB0EIDH_EID_LENGTH                      equ 0008h
TXB0EIDH_EID_MASK                        equ 00FFh

// Register: TXB0EIDL
#define TXB0EIDL TXB0EIDL
TXB0EIDL                                 equ 037E4h
// bitfield definitions
TXB0EIDL_EID0_POSN                       equ 0000h
TXB0EIDL_EID0_POSITION                   equ 0000h
TXB0EIDL_EID0_SIZE                       equ 0001h
TXB0EIDL_EID0_LENGTH                     equ 0001h
TXB0EIDL_EID0_MASK                       equ 0001h
TXB0EIDL_EID1_POSN                       equ 0001h
TXB0EIDL_EID1_POSITION                   equ 0001h
TXB0EIDL_EID1_SIZE                       equ 0001h
TXB0EIDL_EID1_LENGTH                     equ 0001h
TXB0EIDL_EID1_MASK                       equ 0002h
TXB0EIDL_EID2_POSN                       equ 0002h
TXB0EIDL_EID2_POSITION                   equ 0002h
TXB0EIDL_EID2_SIZE                       equ 0001h
TXB0EIDL_EID2_LENGTH                     equ 0001h
TXB0EIDL_EID2_MASK                       equ 0004h
TXB0EIDL_EID3_POSN                       equ 0003h
TXB0EIDL_EID3_POSITION                   equ 0003h
TXB0EIDL_EID3_SIZE                       equ 0001h
TXB0EIDL_EID3_LENGTH                     equ 0001h
TXB0EIDL_EID3_MASK                       equ 0008h
TXB0EIDL_EID4_POSN                       equ 0004h
TXB0EIDL_EID4_POSITION                   equ 0004h
TXB0EIDL_EID4_SIZE                       equ 0001h
TXB0EIDL_EID4_LENGTH                     equ 0001h
TXB0EIDL_EID4_MASK                       equ 0010h
TXB0EIDL_EID5_POSN                       equ 0005h
TXB0EIDL_EID5_POSITION                   equ 0005h
TXB0EIDL_EID5_SIZE                       equ 0001h
TXB0EIDL_EID5_LENGTH                     equ 0001h
TXB0EIDL_EID5_MASK                       equ 0020h
TXB0EIDL_EID6_POSN                       equ 0006h
TXB0EIDL_EID6_POSITION                   equ 0006h
TXB0EIDL_EID6_SIZE                       equ 0001h
TXB0EIDL_EID6_LENGTH                     equ 0001h
TXB0EIDL_EID6_MASK                       equ 0040h
TXB0EIDL_EID7_POSN                       equ 0007h
TXB0EIDL_EID7_POSITION                   equ 0007h
TXB0EIDL_EID7_SIZE                       equ 0001h
TXB0EIDL_EID7_LENGTH                     equ 0001h
TXB0EIDL_EID7_MASK                       equ 0080h
TXB0EIDL_EID_POSN                        equ 0000h
TXB0EIDL_EID_POSITION                    equ 0000h
TXB0EIDL_EID_SIZE                        equ 0008h
TXB0EIDL_EID_LENGTH                      equ 0008h
TXB0EIDL_EID_MASK                        equ 00FFh

// Register: TXB0DLC
#define TXB0DLC TXB0DLC
TXB0DLC                                  equ 037E5h
// bitfield definitions
TXB0DLC_DLC_POSN                         equ 0000h
TXB0DLC_DLC_POSITION                     equ 0000h
TXB0DLC_DLC_SIZE                         equ 0004h
TXB0DLC_DLC_LENGTH                       equ 0004h
TXB0DLC_DLC_MASK                         equ 000Fh
TXB0DLC_TXRTR_POSN                       equ 0006h
TXB0DLC_TXRTR_POSITION                   equ 0006h
TXB0DLC_TXRTR_SIZE                       equ 0001h
TXB0DLC_TXRTR_LENGTH                     equ 0001h
TXB0DLC_TXRTR_MASK                       equ 0040h
TXB0DLC_DLC0_POSN                        equ 0000h
TXB0DLC_DLC0_POSITION                    equ 0000h
TXB0DLC_DLC0_SIZE                        equ 0001h
TXB0DLC_DLC0_LENGTH                      equ 0001h
TXB0DLC_DLC0_MASK                        equ 0001h
TXB0DLC_DLC1_POSN                        equ 0001h
TXB0DLC_DLC1_POSITION                    equ 0001h
TXB0DLC_DLC1_SIZE                        equ 0001h
TXB0DLC_DLC1_LENGTH                      equ 0001h
TXB0DLC_DLC1_MASK                        equ 0002h
TXB0DLC_DLC2_POSN                        equ 0002h
TXB0DLC_DLC2_POSITION                    equ 0002h
TXB0DLC_DLC2_SIZE                        equ 0001h
TXB0DLC_DLC2_LENGTH                      equ 0001h
TXB0DLC_DLC2_MASK                        equ 0004h
TXB0DLC_DLC3_POSN                        equ 0003h
TXB0DLC_DLC3_POSITION                    equ 0003h
TXB0DLC_DLC3_SIZE                        equ 0001h
TXB0DLC_DLC3_LENGTH                      equ 0001h
TXB0DLC_DLC3_MASK                        equ 0008h

