GopalSaraf/Practicals/PSDL/include/proc/pic18lf25k83.inc
// Register: CANCON_RO0
#define CANCON_RO0 CANCON_RO0
CANCON_RO0                               equ 037FFh
// bitfield definitions
CANCON_RO0_FP0_POSN                      equ 0000h
CANCON_RO0_FP0_POSITION                  equ 0000h
CANCON_RO0_FP0_SIZE                      equ 0001h
CANCON_RO0_FP0_LENGTH                    equ 0001h
CANCON_RO0_FP0_MASK                      equ 0001h
CANCON_RO0_WIN0_FP1_POSN                 equ 0001h
CANCON_RO0_WIN0_FP1_POSITION             equ 0001h
CANCON_RO0_WIN0_FP1_SIZE                 equ 0001h
CANCON_RO0_WIN0_FP1_LENGTH               equ 0001h
CANCON_RO0_WIN0_FP1_MASK                 equ 0002h
CANCON_RO0_WIN1_FP2_POSN                 equ 0002h
CANCON_RO0_WIN1_FP2_POSITION             equ 0002h
CANCON_RO0_WIN1_FP2_SIZE                 equ 0001h
CANCON_RO0_WIN1_FP2_LENGTH               equ 0001h
CANCON_RO0_WIN1_FP2_MASK                 equ 0004h
CANCON_RO0_WIN2_FP3_POSN                 equ 0003h
CANCON_RO0_WIN2_FP3_POSITION             equ 0003h
CANCON_RO0_WIN2_FP3_SIZE                 equ 0001h
CANCON_RO0_WIN2_FP3_LENGTH               equ 0001h
CANCON_RO0_WIN2_FP3_MASK                 equ 0008h
CANCON_RO0_ABAT_POSN                     equ 0004h
CANCON_RO0_ABAT_POSITION                 equ 0004h
CANCON_RO0_ABAT_SIZE                     equ 0001h
CANCON_RO0_ABAT_LENGTH                   equ 0001h
CANCON_RO0_ABAT_MASK                     equ 0010h
CANCON_RO0_REQOP_POSN                    equ 0005h
CANCON_RO0_REQOP_POSITION                equ 0005h
CANCON_RO0_REQOP_SIZE                    equ 0003h
CANCON_RO0_REQOP_LENGTH                  equ 0003h
CANCON_RO0_REQOP_MASK                    equ 00E0h
CANCON_RO0_WIN0_POSN                     equ 0001h
CANCON_RO0_WIN0_POSITION                 equ 0001h
CANCON_RO0_WIN0_SIZE                     equ 0001h
CANCON_RO0_WIN0_LENGTH                   equ 0001h
CANCON_RO0_WIN0_MASK                     equ 0002h
CANCON_RO0_WIN1_POSN                     equ 0002h
CANCON_RO0_WIN1_POSITION                 equ 0002h
CANCON_RO0_WIN1_SIZE                     equ 0001h
CANCON_RO0_WIN1_LENGTH                   equ 0001h
CANCON_RO0_WIN1_MASK                     equ 0004h
CANCON_RO0_WIN2_POSN                     equ 0003h
CANCON_RO0_WIN2_POSITION                 equ 0003h
CANCON_RO0_WIN2_SIZE                     equ 0001h
CANCON_RO0_WIN2_LENGTH                   equ 0001h
CANCON_RO0_WIN2_MASK                     equ 0008h
CANCON_RO0_REQOP0_POSN                   equ 0005h
CANCON_RO0_REQOP0_POSITION               equ 0005h
CANCON_RO0_REQOP0_SIZE                   equ 0001h
CANCON_RO0_REQOP0_LENGTH                 equ 0001h
CANCON_RO0_REQOP0_MASK                   equ 0020h
CANCON_RO0_REQOP1_POSN                   equ 0006h
CANCON_RO0_REQOP1_POSITION               equ 0006h
CANCON_RO0_REQOP1_SIZE                   equ 0001h
CANCON_RO0_REQOP1_LENGTH                 equ 0001h
CANCON_RO0_REQOP1_MASK                   equ 0040h
CANCON_RO0_REQOP2_POSN                   equ 0007h
CANCON_RO0_REQOP2_POSITION               equ 0007h
CANCON_RO0_REQOP2_SIZE                   equ 0001h
CANCON_RO0_REQOP2_LENGTH                 equ 0001h
CANCON_RO0_REQOP2_MASK                   equ 0080h
CANCON_RO0_FP1_POSN                      equ 0001h
CANCON_RO0_FP1_POSITION                  equ 0001h
CANCON_RO0_FP1_SIZE                      equ 0001h
CANCON_RO0_FP1_LENGTH                    equ 0001h
CANCON_RO0_FP1_MASK                      equ 0002h
CANCON_RO0_FP2_POSN                      equ 0002h
CANCON_RO0_FP2_POSITION                  equ 0002h
CANCON_RO0_FP2_SIZE                      equ 0001h
CANCON_RO0_FP2_LENGTH                    equ 0001h
CANCON_RO0_FP2_MASK                      equ 0004h
CANCON_RO0_FP3_POSN                      equ 0003h
CANCON_RO0_FP3_POSITION                  equ 0003h
CANCON_RO0_FP3_SIZE                      equ 0001h
CANCON_RO0_FP3_LENGTH                    equ 0001h
CANCON_RO0_FP3_MASK                      equ 0008h
CANCON_RO0_WIN_POSN                      equ 0001h
CANCON_RO0_WIN_POSITION                  equ 0001h
CANCON_RO0_WIN_SIZE                      equ 0003h
CANCON_RO0_WIN_LENGTH                    equ 0003h
CANCON_RO0_WIN_MASK                      equ 000Eh
CANCON_RO0_FP_POSN                       equ 0000h
CANCON_RO0_FP_POSITION                   equ 0000h
CANCON_RO0_FP_SIZE                       equ 0004h
CANCON_RO0_FP_LENGTH                     equ 0004h
CANCON_RO0_FP_MASK                       equ 000Fh

// Register: STATUS_CSHAD
#define STATUS_CSHAD STATUS_CSHAD
STATUS_CSHAD                             equ 03880h
// bitfield definitions
STATUS_CSHAD_NOT_PD_POSN                 equ 0005h
STATUS_CSHAD_NOT_PD_POSITION             equ 0005h
STATUS_CSHAD_NOT_PD_SIZE                 equ 0001h
STATUS_CSHAD_NOT_PD_LENGTH               equ 0001h
STATUS_CSHAD_NOT_PD_MASK                 equ 0020h
STATUS_CSHAD_NOT_TO_POSN                 equ 0006h
STATUS_CSHAD_NOT_TO_POSITION             equ 0006h
STATUS_CSHAD_NOT_TO_SIZE                 equ 0001h
STATUS_CSHAD_NOT_TO_LENGTH               equ 0001h
STATUS_CSHAD_NOT_TO_MASK                 equ 0040h
STATUS_CSHAD_C_POSN                      equ 0000h
STATUS_CSHAD_C_POSITION                  equ 0000h
STATUS_CSHAD_C_SIZE                      equ 0001h
STATUS_CSHAD_C_LENGTH                    equ 0001h
STATUS_CSHAD_C_MASK                      equ 0001h
STATUS_CSHAD_DC_POSN                     equ 0001h
STATUS_CSHAD_DC_POSITION                 equ 0001h
STATUS_CSHAD_DC_SIZE                     equ 0001h
STATUS_CSHAD_DC_LENGTH                   equ 0001h
STATUS_CSHAD_DC_MASK                     equ 0002h
STATUS_CSHAD_Z_POSN                      equ 0002h
STATUS_CSHAD_Z_POSITION                  equ 0002h
STATUS_CSHAD_Z_SIZE                      equ 0001h
STATUS_CSHAD_Z_LENGTH                    equ 0001h
STATUS_CSHAD_Z_MASK                      equ 0004h
STATUS_CSHAD_OV_POSN                     equ 0003h
STATUS_CSHAD_OV_POSITION                 equ 0003h
STATUS_CSHAD_OV_SIZE                     equ 0001h
STATUS_CSHAD_OV_LENGTH                   equ 0001h
STATUS_CSHAD_OV_MASK                     equ 0008h
STATUS_CSHAD_N_POSN                      equ 0004h
STATUS_CSHAD_N_POSITION                  equ 0004h
STATUS_CSHAD_N_SIZE                      equ 0001h
STATUS_CSHAD_N_LENGTH                    equ 0001h
STATUS_CSHAD_N_MASK                      equ 0010h
STATUS_CSHAD_nPD_POSN                    equ 0005h
STATUS_CSHAD_nPD_POSITION                equ 0005h
STATUS_CSHAD_nPD_SIZE                    equ 0001h
STATUS_CSHAD_nPD_LENGTH                  equ 0001h
STATUS_CSHAD_nPD_MASK                    equ 0020h
STATUS_CSHAD_nTO_POSN                    equ 0006h
STATUS_CSHAD_nTO_POSITION                equ 0006h
STATUS_CSHAD_nTO_SIZE                    equ 0001h
STATUS_CSHAD_nTO_LENGTH                  equ 0001h
STATUS_CSHAD_nTO_MASK                    equ 0040h
STATUS_CSHAD_PD_POSN                     equ 0005h
STATUS_CSHAD_PD_POSITION                 equ 0005h
STATUS_CSHAD_PD_SIZE                     equ 0001h
STATUS_CSHAD_PD_LENGTH                   equ 0001h
STATUS_CSHAD_PD_MASK                     equ 0020h
STATUS_CSHAD_TO_POSN                     equ 0006h
STATUS_CSHAD_TO_POSITION                 equ 0006h
STATUS_CSHAD_TO_SIZE                     equ 0001h
STATUS_CSHAD_TO_LENGTH                   equ 0001h
STATUS_CSHAD_TO_MASK                     equ 0040h

// Register: WREG_CSHAD
#define WREG_CSHAD WREG_CSHAD
WREG_CSHAD                               equ 03881h
// bitfield definitions
WREG_CSHAD_WREG_POSN                     equ 0000h
WREG_CSHAD_WREG_POSITION                 equ 0000h
WREG_CSHAD_WREG_SIZE                     equ 0008h
WREG_CSHAD_WREG_LENGTH                   equ 0008h
WREG_CSHAD_WREG_MASK                     equ 00FFh

// Register: BSR_CSHAD
#define BSR_CSHAD BSR_CSHAD
BSR_CSHAD                                equ 03882h

// Register: SHADCON
#define SHADCON SHADCON
SHADCON                                  equ 03883h
// bitfield definitions
SHADCON_SHADLO_POSN                      equ 0000h
SHADCON_SHADLO_POSITION                  equ 0000h
SHADCON_SHADLO_SIZE                      equ 0001h
SHADCON_SHADLO_LENGTH                    equ 0001h
SHADCON_SHADLO_MASK                      equ 0001h

// Register: STATUS_SHAD
#define STATUS_SHAD STATUS_SHAD
STATUS_SHAD                              equ 03884h
// bitfield definitions
STATUS_SHAD_NOT_PD_POSN                  equ 0005h
STATUS_SHAD_NOT_PD_POSITION              equ 0005h
STATUS_SHAD_NOT_PD_SIZE                  equ 0001h
STATUS_SHAD_NOT_PD_LENGTH                equ 0001h
STATUS_SHAD_NOT_PD_MASK                  equ 0020h
STATUS_SHAD_NOT_TO_POSN                  equ 0006h
STATUS_SHAD_NOT_TO_POSITION              equ 0006h
STATUS_SHAD_NOT_TO_SIZE                  equ 0001h
STATUS_SHAD_NOT_TO_LENGTH                equ 0001h
STATUS_SHAD_NOT_TO_MASK                  equ 0040h
STATUS_SHAD_C_POSN                       equ 0000h
STATUS_SHAD_C_POSITION                   equ 0000h
STATUS_SHAD_C_SIZE                       equ 0001h
STATUS_SHAD_C_LENGTH                     equ 0001h
STATUS_SHAD_C_MASK                       equ 0001h
STATUS_SHAD_DC_POSN                      equ 0001h
STATUS_SHAD_DC_POSITION                  equ 0001h
STATUS_SHAD_DC_SIZE                      equ 0001h
STATUS_SHAD_DC_LENGTH                    equ 0001h
STATUS_SHAD_DC_MASK                      equ 0002h
STATUS_SHAD_Z_POSN                       equ 0002h
STATUS_SHAD_Z_POSITION                   equ 0002h
STATUS_SHAD_Z_SIZE                       equ 0001h
STATUS_SHAD_Z_LENGTH                     equ 0001h
STATUS_SHAD_Z_MASK                       equ 0004h
STATUS_SHAD_OV_POSN                      equ 0003h
STATUS_SHAD_OV_POSITION                  equ 0003h
STATUS_SHAD_OV_SIZE                      equ 0001h
STATUS_SHAD_OV_LENGTH                    equ 0001h
STATUS_SHAD_OV_MASK                      equ 0008h
STATUS_SHAD_N_POSN                       equ 0004h
STATUS_SHAD_N_POSITION                   equ 0004h
STATUS_SHAD_N_SIZE                       equ 0001h
STATUS_SHAD_N_LENGTH                     equ 0001h
STATUS_SHAD_N_MASK                       equ 0010h
STATUS_SHAD_nPD_POSN                     equ 0005h
STATUS_SHAD_nPD_POSITION                 equ 0005h
STATUS_SHAD_nPD_SIZE                     equ 0001h
STATUS_SHAD_nPD_LENGTH                   equ 0001h
STATUS_SHAD_nPD_MASK                     equ 0020h
STATUS_SHAD_nTO_POSN                     equ 0006h
STATUS_SHAD_nTO_POSITION                 equ 0006h
STATUS_SHAD_nTO_SIZE                     equ 0001h
STATUS_SHAD_nTO_LENGTH                   equ 0001h
STATUS_SHAD_nTO_MASK                     equ 0040h
STATUS_SHAD_PD_POSN                      equ 0005h
STATUS_SHAD_PD_POSITION                  equ 0005h
STATUS_SHAD_PD_SIZE                      equ 0001h
STATUS_SHAD_PD_LENGTH                    equ 0001h
STATUS_SHAD_PD_MASK                      equ 0020h
STATUS_SHAD_TO_POSN                      equ 0006h
STATUS_SHAD_TO_POSITION                  equ 0006h
STATUS_SHAD_TO_SIZE                      equ 0001h
STATUS_SHAD_TO_LENGTH                    equ 0001h
STATUS_SHAD_TO_MASK                      equ 0040h

// Register: WREG_SHAD
#define WREG_SHAD WREG_SHAD
WREG_SHAD                                equ 03885h
// bitfield definitions
WREG_SHAD_WREG_POSN                      equ 0000h
WREG_SHAD_WREG_POSITION                  equ 0000h
WREG_SHAD_WREG_SIZE                      equ 0008h
WREG_SHAD_WREG_LENGTH                    equ 0008h
WREG_SHAD_WREG_MASK                      equ 00FFh

// Register: BSR_SHAD
#define BSR_SHAD BSR_SHAD
BSR_SHAD                                 equ 03886h

// Register: PCLATH_SHAD
#define PCLATH_SHAD PCLATH_SHAD
PCLATH_SHAD                              equ 03887h
// bitfield definitions
PCLATH_SHAD_PCH_POSN                     equ 0000h
PCLATH_SHAD_PCH_POSITION                 equ 0000h
PCLATH_SHAD_PCH_SIZE                     equ 0008h
PCLATH_SHAD_PCH_LENGTH                   equ 0008h
PCLATH_SHAD_PCH_MASK                     equ 00FFh

