GopalSaraf/Practicals/PSDL/include/proc/pic18lf25k83.inc
// Register: SMT1CON1
#define SMT1CON1 SMT1CON1
SMT1CON1                                 equ 03F1Fh
// bitfield definitions
SMT1CON1_MODE_POSN                       equ 0000h
SMT1CON1_MODE_POSITION                   equ 0000h
SMT1CON1_MODE_SIZE                       equ 0004h
SMT1CON1_MODE_LENGTH                     equ 0004h
SMT1CON1_MODE_MASK                       equ 000Fh
SMT1CON1_REPEAT_POSN                     equ 0006h
SMT1CON1_REPEAT_POSITION                 equ 0006h
SMT1CON1_REPEAT_SIZE                     equ 0001h
SMT1CON1_REPEAT_LENGTH                   equ 0001h
SMT1CON1_REPEAT_MASK                     equ 0040h
SMT1CON1_GO_POSN                         equ 0007h
SMT1CON1_GO_POSITION                     equ 0007h
SMT1CON1_GO_SIZE                         equ 0001h
SMT1CON1_GO_LENGTH                       equ 0001h
SMT1CON1_GO_MASK                         equ 0080h
SMT1CON1_MODE0_POSN                      equ 0000h
SMT1CON1_MODE0_POSITION                  equ 0000h
SMT1CON1_MODE0_SIZE                      equ 0001h
SMT1CON1_MODE0_LENGTH                    equ 0001h
SMT1CON1_MODE0_MASK                      equ 0001h
SMT1CON1_MODE1_POSN                      equ 0001h
SMT1CON1_MODE1_POSITION                  equ 0001h
SMT1CON1_MODE1_SIZE                      equ 0001h
SMT1CON1_MODE1_LENGTH                    equ 0001h
SMT1CON1_MODE1_MASK                      equ 0002h
SMT1CON1_MODE2_POSN                      equ 0002h
SMT1CON1_MODE2_POSITION                  equ 0002h
SMT1CON1_MODE2_SIZE                      equ 0001h
SMT1CON1_MODE2_LENGTH                    equ 0001h
SMT1CON1_MODE2_MASK                      equ 0004h
SMT1CON1_MODE3_POSN                      equ 0003h
SMT1CON1_MODE3_POSITION                  equ 0003h
SMT1CON1_MODE3_SIZE                      equ 0001h
SMT1CON1_MODE3_LENGTH                    equ 0001h
SMT1CON1_MODE3_MASK                      equ 0008h
SMT1CON1_SMT1REPEAT_POSN                 equ 0006h
SMT1CON1_SMT1REPEAT_POSITION             equ 0006h
SMT1CON1_SMT1REPEAT_SIZE                 equ 0001h
SMT1CON1_SMT1REPEAT_LENGTH               equ 0001h
SMT1CON1_SMT1REPEAT_MASK                 equ 0040h
SMT1CON1_SMT1GO_POSN                     equ 0007h
SMT1CON1_SMT1GO_POSITION                 equ 0007h
SMT1CON1_SMT1GO_SIZE                     equ 0001h
SMT1CON1_SMT1GO_LENGTH                   equ 0001h
SMT1CON1_SMT1GO_MASK                     equ 0080h
SMT1CON1_SMT1MODE_POSN                   equ 0000h
SMT1CON1_SMT1MODE_POSITION               equ 0000h
SMT1CON1_SMT1MODE_SIZE                   equ 0004h
SMT1CON1_SMT1MODE_LENGTH                 equ 0004h
SMT1CON1_SMT1MODE_MASK                   equ 000Fh

// Register: SMT1STAT
#define SMT1STAT SMT1STAT
SMT1STAT                                 equ 03F20h
// bitfield definitions
SMT1STAT_AS_POSN                         equ 0000h
SMT1STAT_AS_POSITION                     equ 0000h
SMT1STAT_AS_SIZE                         equ 0001h
SMT1STAT_AS_LENGTH                       equ 0001h
SMT1STAT_AS_MASK                         equ 0001h
SMT1STAT_WS_POSN                         equ 0001h
SMT1STAT_WS_POSITION                     equ 0001h
SMT1STAT_WS_SIZE                         equ 0001h
SMT1STAT_WS_LENGTH                       equ 0001h
SMT1STAT_WS_MASK                         equ 0002h
SMT1STAT_TS_POSN                         equ 0002h
SMT1STAT_TS_POSITION                     equ 0002h
SMT1STAT_TS_SIZE                         equ 0001h
SMT1STAT_TS_LENGTH                       equ 0001h
SMT1STAT_TS_MASK                         equ 0004h
SMT1STAT_RST_POSN                        equ 0005h
SMT1STAT_RST_POSITION                    equ 0005h
SMT1STAT_RST_SIZE                        equ 0001h
SMT1STAT_RST_LENGTH                      equ 0001h
SMT1STAT_RST_MASK                        equ 0020h
SMT1STAT_CPWUP_POSN                      equ 0006h
SMT1STAT_CPWUP_POSITION                  equ 0006h
SMT1STAT_CPWUP_SIZE                      equ 0001h
SMT1STAT_CPWUP_LENGTH                    equ 0001h
SMT1STAT_CPWUP_MASK                      equ 0040h
SMT1STAT_CPRUP_POSN                      equ 0007h
SMT1STAT_CPRUP_POSITION                  equ 0007h
SMT1STAT_CPRUP_SIZE                      equ 0001h
SMT1STAT_CPRUP_LENGTH                    equ 0001h
SMT1STAT_CPRUP_MASK                      equ 0080h
SMT1STAT_SMT1AS_POSN                     equ 0000h
SMT1STAT_SMT1AS_POSITION                 equ 0000h
SMT1STAT_SMT1AS_SIZE                     equ 0001h
SMT1STAT_SMT1AS_LENGTH                   equ 0001h
SMT1STAT_SMT1AS_MASK                     equ 0001h
SMT1STAT_SMT1WS_POSN                     equ 0001h
SMT1STAT_SMT1WS_POSITION                 equ 0001h
SMT1STAT_SMT1WS_SIZE                     equ 0001h
SMT1STAT_SMT1WS_LENGTH                   equ 0001h
SMT1STAT_SMT1WS_MASK                     equ 0002h
SMT1STAT_SMT1TS_POSN                     equ 0002h
SMT1STAT_SMT1TS_POSITION                 equ 0002h
SMT1STAT_SMT1TS_SIZE                     equ 0001h
SMT1STAT_SMT1TS_LENGTH                   equ 0001h
SMT1STAT_SMT1TS_MASK                     equ 0004h
SMT1STAT_SMT1RESET_POSN                  equ 0005h
SMT1STAT_SMT1RESET_POSITION              equ 0005h
SMT1STAT_SMT1RESET_SIZE                  equ 0001h
SMT1STAT_SMT1RESET_LENGTH                equ 0001h
SMT1STAT_SMT1RESET_MASK                  equ 0020h
SMT1STAT_SMT1CPWUP_POSN                  equ 0006h
SMT1STAT_SMT1CPWUP_POSITION              equ 0006h
SMT1STAT_SMT1CPWUP_SIZE                  equ 0001h
SMT1STAT_SMT1CPWUP_LENGTH                equ 0001h
SMT1STAT_SMT1CPWUP_MASK                  equ 0040h
SMT1STAT_SMT1CPRUP_POSN                  equ 0007h
SMT1STAT_SMT1CPRUP_POSITION              equ 0007h
SMT1STAT_SMT1CPRUP_SIZE                  equ 0001h
SMT1STAT_SMT1CPRUP_LENGTH                equ 0001h
SMT1STAT_SMT1CPRUP_MASK                  equ 0080h
SMT1STAT_SMT1RST_POSN                    equ 0005h
SMT1STAT_SMT1RST_POSITION                equ 0005h
SMT1STAT_SMT1RST_SIZE                    equ 0001h
SMT1STAT_SMT1RST_LENGTH                  equ 0001h
SMT1STAT_SMT1RST_MASK                    equ 0020h

// Register: SMT1CLK
#define SMT1CLK SMT1CLK
SMT1CLK                                  equ 03F21h
// bitfield definitions
SMT1CLK_CSEL_POSN                        equ 0000h
SMT1CLK_CSEL_POSITION                    equ 0000h
SMT1CLK_CSEL_SIZE                        equ 0003h
SMT1CLK_CSEL_LENGTH                      equ 0003h
SMT1CLK_CSEL_MASK                        equ 0007h
SMT1CLK_CSEL0_POSN                       equ 0000h
SMT1CLK_CSEL0_POSITION                   equ 0000h
SMT1CLK_CSEL0_SIZE                       equ 0001h
SMT1CLK_CSEL0_LENGTH                     equ 0001h
SMT1CLK_CSEL0_MASK                       equ 0001h
SMT1CLK_CSEL1_POSN                       equ 0001h
SMT1CLK_CSEL1_POSITION                   equ 0001h
SMT1CLK_CSEL1_SIZE                       equ 0001h
SMT1CLK_CSEL1_LENGTH                     equ 0001h
SMT1CLK_CSEL1_MASK                       equ 0002h
SMT1CLK_CSEL2_POSN                       equ 0002h
SMT1CLK_CSEL2_POSITION                   equ 0002h
SMT1CLK_CSEL2_SIZE                       equ 0001h
SMT1CLK_CSEL2_LENGTH                     equ 0001h
SMT1CLK_CSEL2_MASK                       equ 0004h
SMT1CLK_SMT1CSEL_POSN                    equ 0000h
SMT1CLK_SMT1CSEL_POSITION                equ 0000h
SMT1CLK_SMT1CSEL_SIZE                    equ 0003h
SMT1CLK_SMT1CSEL_LENGTH                  equ 0003h
SMT1CLK_SMT1CSEL_MASK                    equ 0007h
SMT1CLK_SMT1CSEL0_POSN                   equ 0000h
SMT1CLK_SMT1CSEL0_POSITION               equ 0000h
SMT1CLK_SMT1CSEL0_SIZE                   equ 0001h
SMT1CLK_SMT1CSEL0_LENGTH                 equ 0001h
SMT1CLK_SMT1CSEL0_MASK                   equ 0001h
SMT1CLK_SMT1CSEL1_POSN                   equ 0001h
SMT1CLK_SMT1CSEL1_POSITION               equ 0001h
SMT1CLK_SMT1CSEL1_SIZE                   equ 0001h
SMT1CLK_SMT1CSEL1_LENGTH                 equ 0001h
SMT1CLK_SMT1CSEL1_MASK                   equ 0002h
SMT1CLK_SMT1CSEL2_POSN                   equ 0002h
SMT1CLK_SMT1CSEL2_POSITION               equ 0002h
SMT1CLK_SMT1CSEL2_SIZE                   equ 0001h
SMT1CLK_SMT1CSEL2_LENGTH                 equ 0001h
SMT1CLK_SMT1CSEL2_MASK                   equ 0004h

// Register: SMT1SIG
#define SMT1SIG SMT1SIG
SMT1SIG                                  equ 03F22h
// bitfield definitions
SMT1SIG_SSEL_POSN                        equ 0000h
SMT1SIG_SSEL_POSITION                    equ 0000h
SMT1SIG_SSEL_SIZE                        equ 0005h
SMT1SIG_SSEL_LENGTH                      equ 0005h
SMT1SIG_SSEL_MASK                        equ 001Fh
SMT1SIG_SSEL0_POSN                       equ 0000h
SMT1SIG_SSEL0_POSITION                   equ 0000h
SMT1SIG_SSEL0_SIZE                       equ 0001h
SMT1SIG_SSEL0_LENGTH                     equ 0001h
SMT1SIG_SSEL0_MASK                       equ 0001h
SMT1SIG_SSEL1_POSN                       equ 0001h
SMT1SIG_SSEL1_POSITION                   equ 0001h
SMT1SIG_SSEL1_SIZE                       equ 0001h
SMT1SIG_SSEL1_LENGTH                     equ 0001h
SMT1SIG_SSEL1_MASK                       equ 0002h
SMT1SIG_SSEL2_POSN                       equ 0002h
SMT1SIG_SSEL2_POSITION                   equ 0002h
SMT1SIG_SSEL2_SIZE                       equ 0001h
SMT1SIG_SSEL2_LENGTH                     equ 0001h
SMT1SIG_SSEL2_MASK                       equ 0004h
SMT1SIG_SSEL3_POSN                       equ 0003h
SMT1SIG_SSEL3_POSITION                   equ 0003h
SMT1SIG_SSEL3_SIZE                       equ 0001h
SMT1SIG_SSEL3_LENGTH                     equ 0001h
SMT1SIG_SSEL3_MASK                       equ 0008h
SMT1SIG_SSEL4_POSN                       equ 0004h
SMT1SIG_SSEL4_POSITION                   equ 0004h
SMT1SIG_SSEL4_SIZE                       equ 0001h
SMT1SIG_SSEL4_LENGTH                     equ 0001h
SMT1SIG_SSEL4_MASK                       equ 0010h
SMT1SIG_SMT1SSEL_POSN                    equ 0000h
SMT1SIG_SMT1SSEL_POSITION                equ 0000h
SMT1SIG_SMT1SSEL_SIZE                    equ 0005h
SMT1SIG_SMT1SSEL_LENGTH                  equ 0005h
SMT1SIG_SMT1SSEL_MASK                    equ 001Fh
SMT1SIG_SMT1SSEL0_POSN                   equ 0000h
SMT1SIG_SMT1SSEL0_POSITION               equ 0000h
SMT1SIG_SMT1SSEL0_SIZE                   equ 0001h
SMT1SIG_SMT1SSEL0_LENGTH                 equ 0001h
SMT1SIG_SMT1SSEL0_MASK                   equ 0001h
SMT1SIG_SMT1SSEL1_POSN                   equ 0001h
SMT1SIG_SMT1SSEL1_POSITION               equ 0001h
SMT1SIG_SMT1SSEL1_SIZE                   equ 0001h
SMT1SIG_SMT1SSEL1_LENGTH                 equ 0001h
SMT1SIG_SMT1SSEL1_MASK                   equ 0002h
SMT1SIG_SMT1SSEL2_POSN                   equ 0002h
SMT1SIG_SMT1SSEL2_POSITION               equ 0002h
SMT1SIG_SMT1SSEL2_SIZE                   equ 0001h
SMT1SIG_SMT1SSEL2_LENGTH                 equ 0001h
SMT1SIG_SMT1SSEL2_MASK                   equ 0004h
SMT1SIG_SMT1SSEL3_POSN                   equ 0003h
SMT1SIG_SMT1SSEL3_POSITION               equ 0003h
SMT1SIG_SMT1SSEL3_SIZE                   equ 0001h
SMT1SIG_SMT1SSEL3_LENGTH                 equ 0001h
SMT1SIG_SMT1SSEL3_MASK                   equ 0008h
SMT1SIG_SMT1SSEL4_POSN                   equ 0004h
SMT1SIG_SMT1SSEL4_POSITION               equ 0004h
SMT1SIG_SMT1SSEL4_SIZE                   equ 0001h
SMT1SIG_SMT1SSEL4_LENGTH                 equ 0001h
SMT1SIG_SMT1SSEL4_MASK                   equ 0010h

// Register: SMT1WIN
#define SMT1WIN SMT1WIN
SMT1WIN                                  equ 03F23h
// bitfield definitions
SMT1WIN_WSEL_POSN                        equ 0000h
SMT1WIN_WSEL_POSITION                    equ 0000h
SMT1WIN_WSEL_SIZE                        equ 0005h
SMT1WIN_WSEL_LENGTH                      equ 0005h
SMT1WIN_WSEL_MASK                        equ 001Fh
SMT1WIN_WSEL0_POSN                       equ 0000h
SMT1WIN_WSEL0_POSITION                   equ 0000h
SMT1WIN_WSEL0_SIZE                       equ 0001h
SMT1WIN_WSEL0_LENGTH                     equ 0001h
SMT1WIN_WSEL0_MASK                       equ 0001h
SMT1WIN_WSEL1_POSN                       equ 0001h
SMT1WIN_WSEL1_POSITION                   equ 0001h
SMT1WIN_WSEL1_SIZE                       equ 0001h
SMT1WIN_WSEL1_LENGTH                     equ 0001h
SMT1WIN_WSEL1_MASK                       equ 0002h
SMT1WIN_WSEL2_POSN                       equ 0002h
SMT1WIN_WSEL2_POSITION                   equ 0002h
SMT1WIN_WSEL2_SIZE                       equ 0001h
SMT1WIN_WSEL2_LENGTH                     equ 0001h
SMT1WIN_WSEL2_MASK                       equ 0004h
SMT1WIN_WSEL3_POSN                       equ 0003h
SMT1WIN_WSEL3_POSITION                   equ 0003h
SMT1WIN_WSEL3_SIZE                       equ 0001h
SMT1WIN_WSEL3_LENGTH                     equ 0001h
SMT1WIN_WSEL3_MASK                       equ 0008h
SMT1WIN_WSEL4_POSN                       equ 0004h
SMT1WIN_WSEL4_POSITION                   equ 0004h
SMT1WIN_WSEL4_SIZE                       equ 0001h
SMT1WIN_WSEL4_LENGTH                     equ 0001h
SMT1WIN_WSEL4_MASK                       equ 0010h
SMT1WIN_SMT1WSEL_POSN                    equ 0000h
SMT1WIN_SMT1WSEL_POSITION                equ 0000h
SMT1WIN_SMT1WSEL_SIZE                    equ 0005h
SMT1WIN_SMT1WSEL_LENGTH                  equ 0005h
SMT1WIN_SMT1WSEL_MASK                    equ 001Fh
SMT1WIN_SMT1WSEL0_POSN                   equ 0000h
SMT1WIN_SMT1WSEL0_POSITION               equ 0000h
SMT1WIN_SMT1WSEL0_SIZE                   equ 0001h
SMT1WIN_SMT1WSEL0_LENGTH                 equ 0001h
SMT1WIN_SMT1WSEL0_MASK                   equ 0001h
SMT1WIN_SMT1WSEL1_POSN                   equ 0001h
SMT1WIN_SMT1WSEL1_POSITION               equ 0001h
SMT1WIN_SMT1WSEL1_SIZE                   equ 0001h
SMT1WIN_SMT1WSEL1_LENGTH                 equ 0001h
SMT1WIN_SMT1WSEL1_MASK                   equ 0002h
SMT1WIN_SMT1WSEL2_POSN                   equ 0002h
SMT1WIN_SMT1WSEL2_POSITION               equ 0002h
SMT1WIN_SMT1WSEL2_SIZE                   equ 0001h
SMT1WIN_SMT1WSEL2_LENGTH                 equ 0001h
SMT1WIN_SMT1WSEL2_MASK                   equ 0004h
SMT1WIN_SMT1WSEL3_POSN                   equ 0003h
SMT1WIN_SMT1WSEL3_POSITION               equ 0003h
SMT1WIN_SMT1WSEL3_SIZE                   equ 0001h
SMT1WIN_SMT1WSEL3_LENGTH                 equ 0001h
SMT1WIN_SMT1WSEL3_MASK                   equ 0008h
SMT1WIN_SMT1WSEL4_POSN                   equ 0004h
SMT1WIN_SMT1WSEL4_POSITION               equ 0004h
SMT1WIN_SMT1WSEL4_SIZE                   equ 0001h
SMT1WIN_SMT1WSEL4_LENGTH                 equ 0001h
SMT1WIN_SMT1WSEL4_MASK                   equ 0010h

// Register: NCO1ACC
#define NCO1ACC NCO1ACC
NCO1ACC                                  equ 03F38h

