GopalSaraf/Practicals/PSDL/include/proc/pic18lf25k83.inc
#define DMA2SPTR10                       BANKMASK(DMA2SPTRH), 2, b
#define DMA2SPTR11                       BANKMASK(DMA2SPTRH), 3, b
#define DMA2SPTR12                       BANKMASK(DMA2SPTRH), 4, b
#define DMA2SPTR13                       BANKMASK(DMA2SPTRH), 5, b
#define DMA2SPTR14                       BANKMASK(DMA2SPTRH), 6, b
#define DMA2SPTR15                       BANKMASK(DMA2SPTRH), 7, b
#define DMA2SPTR16                       BANKMASK(DMA2SPTRU), 0, b
#define DMA2SPTR17                       BANKMASK(DMA2SPTRU), 1, b
#define DMA2SPTR18                       BANKMASK(DMA2SPTRU), 2, b
#define DMA2SPTR19                       BANKMASK(DMA2SPTRU), 3, b
#define DMA2SPTR2                        BANKMASK(DMA2SPTRL), 2, b
#define DMA2SPTR20                       BANKMASK(DMA2SPTRU), 4, b
#define DMA2SPTR21                       BANKMASK(DMA2SPTRU), 5, b
#define DMA2SPTR3                        BANKMASK(DMA2SPTRL), 3, b
#define DMA2SPTR4                        BANKMASK(DMA2SPTRL), 4, b
#define DMA2SPTR5                        BANKMASK(DMA2SPTRL), 5, b
#define DMA2SPTR6                        BANKMASK(DMA2SPTRL), 6, b
#define DMA2SPTR7                        BANKMASK(DMA2SPTRL), 7, b
#define DMA2SPTR8                        BANKMASK(DMA2SPTRH), 0, b
#define DMA2SPTR9                        BANKMASK(DMA2SPTRH), 1, b
#define DMA2SSA0                         BANKMASK(DMA2SSAL), 0, b
#define DMA2SSA1                         BANKMASK(DMA2SSAL), 1, b
#define DMA2SSA10                        BANKMASK(DMA2SSAH), 2, b
#define DMA2SSA11                        BANKMASK(DMA2SSAH), 3, b
#define DMA2SSA12                        BANKMASK(DMA2SSAH), 4, b
#define DMA2SSA13                        BANKMASK(DMA2SSAH), 5, b
#define DMA2SSA14                        BANKMASK(DMA2SSAH), 6, b
#define DMA2SSA15                        BANKMASK(DMA2SSAH), 7, b
#define DMA2SSA16                        BANKMASK(DMA2SSAU), 0, b
#define DMA2SSA17                        BANKMASK(DMA2SSAU), 1, b
#define DMA2SSA18                        BANKMASK(DMA2SSAU), 2, b
#define DMA2SSA19                        BANKMASK(DMA2SSAU), 3, b
#define DMA2SSA2                         BANKMASK(DMA2SSAL), 2, b
#define DMA2SSA20                        BANKMASK(DMA2SSAU), 4, b
#define DMA2SSA21                        BANKMASK(DMA2SSAU), 5, b
#define DMA2SSA3                         BANKMASK(DMA2SSAL), 3, b
#define DMA2SSA4                         BANKMASK(DMA2SSAL), 4, b
#define DMA2SSA5                         BANKMASK(DMA2SSAL), 5, b
#define DMA2SSA6                         BANKMASK(DMA2SSAL), 6, b
#define DMA2SSA7                         BANKMASK(DMA2SSAL), 7, b
#define DMA2SSA8                         BANKMASK(DMA2SSAH), 0, b
#define DMA2SSA9                         BANKMASK(DMA2SSAH), 1, b
#define DMA2SSZ0                         BANKMASK(DMA2SSZL), 0, b
#define DMA2SSZ1                         BANKMASK(DMA2SSZL), 1, b
#define DMA2SSZ10                        BANKMASK(DMA2SSZH), 2, b
#define DMA2SSZ11                        BANKMASK(DMA2SSZH), 3, b
#define DMA2SSZ2                         BANKMASK(DMA2SSZL), 2, b
#define DMA2SSZ3                         BANKMASK(DMA2SSZL), 3, b
#define DMA2SSZ4                         BANKMASK(DMA2SSZL), 4, b
#define DMA2SSZ5                         BANKMASK(DMA2SSZL), 5, b
#define DMA2SSZ6                         BANKMASK(DMA2SSZL), 6, b
#define DMA2SSZ7                         BANKMASK(DMA2SSZL), 7, b
#define DMA2SSZ8                         BANKMASK(DMA2SSZH), 0, b
#define DMA2SSZ9                         BANKMASK(DMA2SSZH), 1, b
#define DMA2XIP                          BANKMASK(DMA2CON0), 0, b
#define DOE                              BANKMASK(CPUDOZE), 4, b
#define DONE                             BANKMASK(ADCON0), 0, b
#define DOZE0                            BANKMASK(CPUDOZE), 0, b
#define DOZE1                            BANKMASK(CPUDOZE), 1, b
#define DOZE2                            BANKMASK(CPUDOZE), 2, b
#define DOZEN                            BANKMASK(CPUDOZE), 6, b
#define DSEN                             BANKMASK(ADCON1), 0, b
#define DSMMD                            BANKMASK(PMD6), 0, b
#define EICOD1_ICODE0                    BANKMASK(CANSTAT_RO5), 1, b
#define EICODE3_ICOD2                    BANKMASK(CANSTAT_RO7), 3, b
#define EIDCODE2_ICODE1                  BANKMASK(CANSTAT_RO7), 2, b
#define EIDCODE4                         BANKMASK(CANSTAT_RO4), 4, b
#define EMBMD                            BANKMASK(PMD1), 0, b
#define EOSIE                            BANKMASK(SPI1INTE), 4, b
#define EOSIF                            BANKMASK(SPI1INTF), 4, b
#define ERR0                             BANKMASK(ADERRL), 0, b
#define ERR1                             BANKMASK(ADERRL), 1, b
#define ERR10                            BANKMASK(ADERRH), 2, b
#define ERR11                            BANKMASK(ADERRH), 3, b
#define ERR12                            BANKMASK(ADERRH), 4, b
#define ERR13                            BANKMASK(ADERRH), 5, b
#define ERR14                            BANKMASK(ADERRH), 6, b
#define ERR15                            BANKMASK(ADERRH), 7, b
#define ERR2                             BANKMASK(ADERRL), 2, b
#define ERR3                             BANKMASK(ADERRL), 3, b
#define ERR4                             BANKMASK(ADERRL), 4, b
#define ERR5                             BANKMASK(ADERRL), 5, b
#define ERR6                             BANKMASK(ADERRL), 6, b
#define ERR7                             BANKMASK(ADERRL), 7, b
#define ERR8                             BANKMASK(ADERRH), 0, b
#define ERR9                             BANKMASK(ADERRH), 1, b
#define ERRIE                            BANKMASK(PIE5), 5, b
#define ERRIF                            BANKMASK(PIR5), 5, b
#define ERRIP                            BANKMASK(IPR5), 5, b
#define EVPOL05                          BANKMASK(IPR5), 3, b
#define EVPOL15                          BANKMASK(IPR5), 4, b
#define EWARN                            BANKMASK(COMSTAT), 0, a
#define EWIN0                            BANKMASK(ECANCON), 0, a
#define EWIN1                            BANKMASK(ECANCON), 1, a
#define EWIN2                            BANKMASK(ECANCON), 2, a
#define EWIN3                            BANKMASK(ECANCON), 3, a
#define EWIN4                            BANKMASK(ECANCON), 4, a
#define EXIDF                            BANKMASK(RXF6SIDL), 3, b
#define EXTOEN                           BANKMASK(OSCEN), 7, b
#define EXTOR                            BANKMASK(OSCSTAT), 7, b
#define F0BP_0                           BANKMASK(RXFBCON0), 0, b
#define F0BP_1                           BANKMASK(RXFBCON0), 1, b
#define F0BP_2                           BANKMASK(RXFBCON0), 2, b
#define F0BP_3                           BANKMASK(RXFBCON0), 3, b
#define F10BP_0                          BANKMASK(RXFBCON5), 0, b
#define F10BP_1                          BANKMASK(RXFBCON5), 1, b
#define F10BP_2                          BANKMASK(RXFBCON5), 2, b
#define F10BP_3                          BANKMASK(RXFBCON5), 3, b
#define F11BP_0                          BANKMASK(RXFBCON5), 4, b
#define F11BP_1                          BANKMASK(RXFBCON5), 5, b
#define F11BP_2                          BANKMASK(RXFBCON5), 6, b
#define F11BP_3                          BANKMASK(RXFBCON5), 7, b
#define F12BP_0                          BANKMASK(RXFBCON6), 0, b
#define F12BP_1                          BANKMASK(RXFBCON6), 1, b
#define F12BP_2                          BANKMASK(RXFBCON6), 2, b
#define F12BP_3                          BANKMASK(RXFBCON6), 3, b
#define F13BP_0                          BANKMASK(RXFBCON6), 4, b
#define F13BP_1                          BANKMASK(RXFBCON6), 5, b
#define F13BP_2                          BANKMASK(RXFBCON6), 6, b
#define F13BP_3                          BANKMASK(RXFBCON6), 7, b
#define F14BP_0                          BANKMASK(RXFBCON7), 0, b
#define F14BP_1                          BANKMASK(RXFBCON7), 1, b
#define F14BP_2                          BANKMASK(RXFBCON7), 2, b
#define F14BP_3                          BANKMASK(RXFBCON7), 3, b
#define F15BP_0                          BANKMASK(RXFBCON7), 4, b
#define F15BP_1                          BANKMASK(RXFBCON7), 5, b
#define F15BP_2                          BANKMASK(RXFBCON7), 6, b
#define F15BP_3                          BANKMASK(RXFBCON7), 7, b
#define F1BP_0                           BANKMASK(RXFBCON0), 4, b
#define F1BP_1                           BANKMASK(RXFBCON0), 5, b
#define F1BP_2                           BANKMASK(RXFBCON0), 6, b
#define F1BP_3                           BANKMASK(RXFBCON0), 7, b
#define F2BP_0                           BANKMASK(RXFBCON1), 0, b
#define F2BP_1                           BANKMASK(RXFBCON1), 1, b
#define F2BP_2                           BANKMASK(RXFBCON1), 2, b
#define F2BP_3                           BANKMASK(RXFBCON1), 3, b
#define F3BP_0                           BANKMASK(RXFBCON1), 4, b
#define F3BP_1                           BANKMASK(RXFBCON1), 5, b
#define F3BP_2                           BANKMASK(RXFBCON1), 6, b
#define F3BP_3                           BANKMASK(RXFBCON1), 7, b
#define F4BP_0                           BANKMASK(RXFBCON2), 0, b
#define F4BP_1                           BANKMASK(RXFBCON2), 1, b
#define F4BP_2                           BANKMASK(RXFBCON2), 2, b
#define F4BP_3                           BANKMASK(RXFBCON2), 3, b
#define F5BP_0                           BANKMASK(RXFBCON2), 4, b
#define F5BP_1                           BANKMASK(RXFBCON2), 5, b
#define F5BP_2                           BANKMASK(RXFBCON2), 6, b
#define F5BP_3                           BANKMASK(RXFBCON2), 7, b
#define F6BP_0                           BANKMASK(RXFBCON3), 0, b
#define F6BP_1                           BANKMASK(RXFBCON3), 1, b
#define F6BP_2                           BANKMASK(RXFBCON3), 2, b
#define F6BP_3                           BANKMASK(RXFBCON3), 3, b
#define F7BP_0                           BANKMASK(RXFBCON3), 4, b
#define F7BP_1                           BANKMASK(RXFBCON3), 5, b
#define F7BP_2                           BANKMASK(RXFBCON3), 6, b
#define F7BP_3                           BANKMASK(RXFBCON3), 7, b
#define F8BP_0                           BANKMASK(RXFBCON4), 0, b
#define F8BP_1                           BANKMASK(RXFBCON4), 1, b
#define F8BP_2                           BANKMASK(RXFBCON4), 2, b
#define F8BP_3                           BANKMASK(RXFBCON4), 3, b
#define F9BP_0                           BANKMASK(RXFBCON4), 4, b
#define F9BP_1                           BANKMASK(RXFBCON4), 5, b
#define F9BP_2                           BANKMASK(RXFBCON4), 6, b
#define F9BP_3                           BANKMASK(RXFBCON4), 7, b
#define FIFOEMPTY                        BANKMASK(COMSTAT), 7, a
#define FIFOFIE                          BANKMASK(PIE5), 0, b
#define FIFOFIF                          BANKMASK(PIR5), 0, b
#define FIFOFIP                          BANKMASK(IPR5), 0, b
#define FIFOWM                           BANKMASK(ECANCON), 5, a
#define FIFOWMIE                         BANKMASK(PIE5), 0, b
#define FIFOWMIF                         BANKMASK(PIR5), 0, b
#define FIFOWMIP                         BANKMASK(IPR5), 0, b
#define FIL0_0                           BANKMASK(MSEL0), 0, b
#define FIL0_1                           BANKMASK(MSEL0), 1, b
#define FIL10_0                          BANKMASK(MSEL2), 4, b
#define FIL10_1                          BANKMASK(MSEL2), 5, b
#define FIL11_0                          BANKMASK(MSEL2), 6, b
#define FIL11_1                          BANKMASK(MSEL2), 7, b
#define FIL12_0                          BANKMASK(MSEL3), 0, b
#define FIL12_1                          BANKMASK(MSEL3), 1, b
#define FIL13_0                          BANKMASK(MSEL3), 2, b
#define FIL13_1                          BANKMASK(MSEL3), 3, b
#define FIL14_0                          BANKMASK(MSEL3), 4, b
#define FIL14_1                          BANKMASK(MSEL3), 5, b
#define FIL15_0                          BANKMASK(MSEL3), 6, b
#define FIL15_1                          BANKMASK(MSEL3), 7, b
#define FIL1_0                           BANKMASK(MSEL0), 2, b
#define FIL1_1                           BANKMASK(MSEL0), 3, b
#define FIL2_0                           BANKMASK(MSEL0), 4, b
#define FIL2_1                           BANKMASK(MSEL0), 5, b
#define FIL3_0                           BANKMASK(MSEL0), 6, b
#define FIL3_1                           BANKMASK(MSEL0), 7, b
#define FIL4_0                           BANKMASK(MSEL1), 0, b
#define FIL4_1                           BANKMASK(MSEL1), 1, b
#define FIL5_0                           BANKMASK(MSEL1), 2, b
#define FIL5_1                           BANKMASK(MSEL1), 3, b
#define FIL6_0                           BANKMASK(MSEL1), 4, b
#define FIL6_1                           BANKMASK(MSEL1), 5, b
#define FIL7_0                           BANKMASK(MSEL1), 6, b
#define FIL7_1                           BANKMASK(MSEL1), 7, b
#define FIL8_0                           BANKMASK(MSEL2), 0, b
#define FIL8_1                           BANKMASK(MSEL2), 1, b
#define FIL9_0                           BANKMASK(MSEL2), 2, b
#define FIL9_1                           BANKMASK(MSEL2), 3, b
#define FLC0                             BANKMASK(SDFLC), 0, b
#define FLC1                             BANKMASK(SDFLC), 1, b
#define FLC2                             BANKMASK(SDFLC), 2, b
#define FLC3                             BANKMASK(SDFLC), 3, b
#define FLC4                             BANKMASK(SDFLC), 4, b
#define FLTR0                            BANKMASK(ADFLTRL), 0, b
#define FLTR1                            BANKMASK(ADFLTRL), 1, b
#define FLTR10                           BANKMASK(ADFLTRH), 2, b
#define FLTR11                           BANKMASK(ADFLTRH), 3, b
#define FLTR12                           BANKMASK(ADFLTRH), 4, b
#define FLTR13                           BANKMASK(ADFLTRH), 5, b
#define FLTR14                           BANKMASK(ADFLTRH), 6, b
#define FLTR15                           BANKMASK(ADFLTRH), 7, b
#define FLTR2                            BANKMASK(ADFLTRL), 2, b
#define FLTR3                            BANKMASK(ADFLTRL), 3, b
#define FLTR4                            BANKMASK(ADFLTRL), 4, b
#define FLTR5                            BANKMASK(ADFLTRL), 5, b
#define FLTR6                            BANKMASK(ADFLTRL), 6, b
#define FLTR7                            BANKMASK(ADFLTRL), 7, b
#define FLTR8                            BANKMASK(ADFLTRH), 0, b
#define FLTR9                            BANKMASK(ADFLTRH), 1, b
#define FM0                              BANKMASK(ADCON0), 2, b
#define FM1                              BANKMASK(ADCON0), 3, b
#define FREE                             BANKMASK(NVMCON1), 4, b
#define FRQ0                             BANKMASK(OSCFRQ), 0, b
#define FRQ1                             BANKMASK(OSCFRQ), 1, b
#define FRQ2                             BANKMASK(OSCFRQ), 2, b
#define FRQ3                             BANKMASK(OSCFRQ), 3, b
#define FST                              BANKMASK(SPI1CON1), 4, b
#define FULL                             BANKMASK(CRCCON0), 0, b
#define FVREN                            BANKMASK(FVRCON), 7, b
#define FVRMD                            BANKMASK(PMD0), 6, b
#define FVRRDY                           BANKMASK(FVRCON), 6, b
#define G1EN                             BANKMASK(CWG1CON0), 7, b
#define G2EN                             BANKMASK(CWG2CON0), 7, b
#define G3EN                             BANKMASK(CWG3CON0), 7, b
#define GIE                              BANKMASK(INTCON0), 7, a
#define GIEH                             BANKMASK(INTCON0), 7, a
#define GIEL                             BANKMASK(INTCON0), 6, a
#define GO_NOT_DONE                      BANKMASK(ADCON0), 0, b
#define GO_nDONE                         BANKMASK(ADCON0), 0, b
#define HADR0                            BANKMASK(SCANHADRL), 0, b
#define HADR1                            BANKMASK(SCANHADRL), 1, b
#define HADR10                           BANKMASK(SCANHADRH), 2, b
#define HADR11                           BANKMASK(SCANHADRH), 3, b
#define HADR12                           BANKMASK(SCANHADRH), 4, b
#define HADR13                           BANKMASK(SCANHADRH), 5, b
#define HADR14                           BANKMASK(SCANHADRH), 6, b
#define HADR15                           BANKMASK(SCANHADRH), 7, b
#define HADR16                           BANKMASK(SCANHADRU), 0, b
#define HADR17                           BANKMASK(SCANHADRU), 1, b
#define HADR18                           BANKMASK(SCANHADRU), 2, b
#define HADR19                           BANKMASK(SCANHADRU), 3, b
#define HADR2                            BANKMASK(SCANHADRL), 2, b
#define HADR20                           BANKMASK(SCANHADRU), 4, b
#define HADR21                           BANKMASK(SCANHADRU), 5, b
#define HADR3                            BANKMASK(SCANHADRL), 3, b
#define HADR4                            BANKMASK(SCANHADRL), 4, b
#define HADR5                            BANKMASK(SCANHADRL), 5, b
#define HADR6                            BANKMASK(SCANHADRL), 6, b
#define HADR7                            BANKMASK(SCANHADRL), 7, b
#define HADR8                            BANKMASK(SCANHADRH), 0, b
#define HADR9                            BANKMASK(SCANHADRH), 1, b
#define HFFRQ0                           BANKMASK(OSCFRQ), 0, b
#define HFFRQ1                           BANKMASK(OSCFRQ), 1, b
#define HFFRQ2                           BANKMASK(OSCFRQ), 2, b
#define HFFRQ3                           BANKMASK(OSCFRQ), 3, b
#define HFOEN                            BANKMASK(OSCEN), 6, b
#define HFOR                             BANKMASK(OSCSTAT), 6, b
#define HFTUN0                           BANKMASK(OSCTUNE), 0, b
#define HFTUN1                           BANKMASK(OSCTUNE), 1, b
#define HFTUN2                           BANKMASK(OSCTUNE), 2, b
#define HFTUN3                           BANKMASK(OSCTUNE), 3, b
#define HFTUN4                           BANKMASK(OSCTUNE), 4, b
#define HFTUN5                           BANKMASK(OSCTUNE), 5, b
#define HLVDEN                           BANKMASK(HLVDCON0), 7, b
#define HLVDIE                           BANKMASK(PIE0), 1, b
#define HLVDIF                           BANKMASK(PIR0), 1, b
#define HLVDINTH                         BANKMASK(HLVDCON0), 1, b
#define HLVDINTL                         BANKMASK(HLVDCON0), 0, b
#define HLVDIP                           BANKMASK(IPR0), 1, b
#define HLVDMD                           BANKMASK(PMD0), 5, b
#define HLVDOUT                          BANKMASK(HLVDCON0), 5, b
#define HLVDRDY                          BANKMASK(HLVDCON0), 4, b
#define HLVDSEL0                         BANKMASK(HLVDCON1), 0, b
#define HLVDSEL1                         BANKMASK(HLVDCON1), 1, b
#define HLVDSEL2                         BANKMASK(HLVDCON1), 2, b
#define HLVDSEL3                         BANKMASK(HLVDCON1), 3, b
#define I2C1EIE                          BANKMASK(PIE3), 2, b
#define I2C1EIF                          BANKMASK(PIR3), 2, b
#define I2C1EIP                          BANKMASK(IPR3), 2, b
#define I2C1IE                           BANKMASK(PIE3), 1, b
#define I2C1IF                           BANKMASK(PIR3), 1, b
#define I2C1IP                           BANKMASK(IPR3), 1, b
#define I2C1MD                           BANKMASK(PMD5), 0, b
#define I2C1RXIE                         BANKMASK(PIE2), 7, b
#define I2C1RXIF                         BANKMASK(PIR2), 7, b
#define I2C1RXIP                         BANKMASK(IPR2), 7, b
#define I2C1TXIE                         BANKMASK(PIE3), 0, b
#define I2C1TXIF                         BANKMASK(PIR3), 0, b
#define I2C1TXIP                         BANKMASK(IPR3), 0, b
#define I2C2EIE                          BANKMASK(PIE7), 3, b
#define I2C2EIF                          BANKMASK(PIR7), 3, b
#define I2C2EIP                          BANKMASK(IPR7), 3, b
#define I2C2IE                           BANKMASK(PIE7), 2, b
#define I2C2IF                           BANKMASK(PIR7), 2, b
#define I2C2IP                           BANKMASK(IPR7), 2, b
#define I2C2MD                           BANKMASK(PMD5), 1, b
#define I2C2RXIE                         BANKMASK(PIE7), 0, b
#define I2C2RXIF                         BANKMASK(PIR7), 0, b
#define I2C2RXIP                         BANKMASK(IPR7), 0, b
#define I2C2TXIE                         BANKMASK(PIE7), 1, b
#define I2C2TXIF                         BANKMASK(PIR7), 1, b
#define I2C2TXIP                         BANKMASK(IPR7), 1, b
#define IDLEN                            BANKMASK(CPUDOZE), 7, b
#define INC0                             BANKMASK(NCO1INCL), 0, b
#define INC1                             BANKMASK(NCO1INCL), 1, b
#define INC10                            BANKMASK(NCO1INCH), 2, b
#define INC11                            BANKMASK(NCO1INCH), 3, b
#define INC12                            BANKMASK(NCO1INCH), 4, b
#define INC13                            BANKMASK(NCO1INCH), 5, b
#define INC14                            BANKMASK(NCO1INCH), 6, b
#define INC15                            BANKMASK(NCO1INCH), 7, b
#define INC16                            BANKMASK(NCO1INCU), 0, b
#define INC17                            BANKMASK(NCO1INCU), 1, b
#define INC18                            BANKMASK(NCO1INCU), 2, b
#define INC19                            BANKMASK(NCO1INCU), 3, b
#define INC2                             BANKMASK(NCO1INCL), 2, b
#define INC3                             BANKMASK(NCO1INCL), 3, b
#define INC4                             BANKMASK(NCO1INCL), 4, b
#define INC5                             BANKMASK(NCO1INCL), 5, b
#define INC6                             BANKMASK(NCO1INCL), 6, b
#define INC7                             BANKMASK(NCO1INCL), 7, b
#define INC8                             BANKMASK(NCO1INCH), 0, b
#define INC9                             BANKMASK(NCO1INCH), 1, b
#define INLVLA0                          BANKMASK(INLVLA), 0, b
#define INLVLA1                          BANKMASK(INLVLA), 1, b
#define INLVLA2                          BANKMASK(INLVLA), 2, b
#define INLVLA3                          BANKMASK(INLVLA), 3, b
#define INLVLA4                          BANKMASK(INLVLA), 4, b
#define INLVLA5                          BANKMASK(INLVLA), 5, b
#define INLVLA6                          BANKMASK(INLVLA), 6, b
#define INLVLA7                          BANKMASK(INLVLA), 7, b
#define INLVLB0                          BANKMASK(INLVLB), 0, b
#define INLVLB1                          BANKMASK(INLVLB), 1, b
#define INLVLB2                          BANKMASK(INLVLB), 2, b
#define INLVLB3                          BANKMASK(INLVLB), 3, b
#define INLVLB4                          BANKMASK(INLVLB), 4, b
#define INLVLB5                          BANKMASK(INLVLB), 5, b
#define INLVLB6                          BANKMASK(INLVLB), 6, b
#define INLVLB7                          BANKMASK(INLVLB), 7, b
#define INLVLC0                          BANKMASK(INLVLC), 0, b
#define INLVLC1                          BANKMASK(INLVLC), 1, b
#define INLVLC2                          BANKMASK(INLVLC), 2, b
#define INLVLC3                          BANKMASK(INLVLC), 3, b
#define INLVLC4                          BANKMASK(INLVLC), 4, b
#define INLVLC5                          BANKMASK(INLVLC), 5, b
#define INLVLC6                          BANKMASK(INLVLC), 6, b
#define INLVLC7                          BANKMASK(INLVLC), 7, b
#define INLVLE3                          BANKMASK(INLVLE), 3, b
#define INT0EDG                          BANKMASK(INTCON0), 0, a
#define INT0IE                           BANKMASK(PIE1), 0, b
#define INT0IF                           BANKMASK(PIR1), 0, b
#define INT0IP                           BANKMASK(IPR1), 0, b
#define INT1EDG                          BANKMASK(INTCON0), 1, a
